{"backend": "theano", "class_name": "Model", "keras_version": "2.0.3", "config": {"layers": [{"inbound_nodes": [], "name": "input_2", "class_name": "InputLayer", "config": {"dtype": "float32", "batch_input_shape": [null, 9, 20], "sparse": false, "name": "input_2"}}, {"inbound_nodes": [], "name": "input_1", "class_name": "InputLayer", "config": {"dtype": "float32", "batch_input_shape": [null, 34, 20], "sparse": false, "name": "input_1"}}, {"inbound_nodes": [[["input_2", 0, 0, {}]]], "name": "batch_normalization_5", "class_name": "BatchNormalization", "config": {"trainable": true, "epsilon": 0.001, "beta_regularizer": null, "gamma_constraint": null, "name": "batch_normalization_5", "axis": -1, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "scale": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99, "gamma_regularizer": null, "beta_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "center": true}}, {"inbound_nodes": [[["input_1", 0, 0, {}]]], "name": "batch_normalization_1", "class_name": "BatchNormalization", "config": {"trainable": true, "epsilon": 0.001, "beta_regularizer": null, "gamma_constraint": null, "name": "batch_normalization_1", "axis": -1, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "scale": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99, "gamma_regularizer": null, "beta_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "center": true}}, {"inbound_nodes": [[["batch_normalization_5", 0, 0, {}]]], "name": "p_re_lu_5", "class_name": "PReLU", "config": {"trainable": true, "shared_axes": null, "alpha_regularizer": null, "name": "p_re_lu_5", "alpha_initializer": {"class_name": "Zeros", "config": {}}, "alpha_constraint": null}}, {"inbound_nodes": [[["batch_normalization_1", 0, 0, {}]]], "name": "p_re_lu_1", "class_name": "PReLU", "config": {"trainable": true, "shared_axes": null, "alpha_regularizer": null, "name": "p_re_lu_1", "alpha_initializer": {"class_name": "Zeros", "config": {}}, "alpha_constraint": null}}, {"inbound_nodes": [[["p_re_lu_5", 0, 0, {}]]], "name": "conv1d_5", "class_name": "Conv1D", "config": {"trainable": true, "activity_regularizer": null, "activation": "linear", "bias_regularizer": null, "kernel_size": [1], "kernel_regularizer": null, "dilation_rate": [1], "name": "conv1d_5", "kernel_constraint": null, "bias_constraint": null, "strides": [1], "use_bias": true, "filters": 192, "padding": "valid", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "normal", "mode": "fan_in", "scale": 2.0, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}}}, {"inbound_nodes": [[["p_re_lu_1", 0, 0, {}]]], "name": "conv1d_1", "class_name": "Conv1D", "config": {"trainable": true, "activity_regularizer": null, "activation": "linear", "bias_regularizer": null, "kernel_size": [1], "kernel_regularizer": null, "dilation_rate": [1], "name": "conv1d_1", "kernel_constraint": null, "bias_constraint": null, "strides": [1], "use_bias": true, "filters": 192, "padding": "valid", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "normal", "mode": "fan_in", "scale": 2.0, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}}}, {"inbound_nodes": [[["conv1d_5", 0, 0, {}]]], "name": "batch_normalization_6", "class_name": "BatchNormalization", "config": {"trainable": true, "epsilon": 0.001, "beta_regularizer": null, "gamma_constraint": null, "name": "batch_normalization_6", "axis": -1, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "scale": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99, "gamma_regularizer": null, "beta_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "center": true}}, {"inbound_nodes": [[["conv1d_1", 0, 0, {}]]], "name": "batch_normalization_2", "class_name": "BatchNormalization", "config": {"trainable": true, "epsilon": 0.001, "beta_regularizer": null, "gamma_constraint": null, "name": "batch_normalization_2", "axis": -1, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "scale": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99, "gamma_regularizer": null, "beta_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "center": true}}, {"inbound_nodes": [[["batch_normalization_6", 0, 0, {}]]], "name": "p_re_lu_6", "class_name": "PReLU", "config": {"trainable": true, "shared_axes": null, "alpha_regularizer": null, "name": "p_re_lu_6", "alpha_initializer": {"class_name": "Zeros", "config": {}}, "alpha_constraint": null}}, {"inbound_nodes": [[["batch_normalization_2", 0, 0, {}]]], "name": "p_re_lu_2", "class_name": "PReLU", "config": {"trainable": true, "shared_axes": null, "alpha_regularizer": null, "name": "p_re_lu_2", "alpha_initializer": {"class_name": "Zeros", "config": {}}, "alpha_constraint": null}}, {"inbound_nodes": [[["p_re_lu_6", 0, 0, {}]]], "name": "conv1d_6", "class_name": "Conv1D", "config": {"trainable": true, "activity_regularizer": null, "activation": "linear", "bias_regularizer": null, "kernel_size": [1], "kernel_regularizer": null, "dilation_rate": [1], "name": "conv1d_6", "kernel_constraint": null, "bias_constraint": null, "strides": [1], "use_bias": true, "filters": 20, "padding": "valid", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "normal", "mode": "fan_in", "scale": 2.0, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}}}, {"inbound_nodes": [[["p_re_lu_2", 0, 0, {}]]], "name": "conv1d_2", "class_name": "Conv1D", "config": {"trainable": true, "activity_regularizer": null, "activation": "linear", "bias_regularizer": null, "kernel_size": [1], "kernel_regularizer": null, "dilation_rate": [1], "name": "conv1d_2", "kernel_constraint": null, "bias_constraint": null, "strides": [1], "use_bias": true, "filters": 20, "padding": "valid", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "normal", "mode": "fan_in", "scale": 2.0, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}}}, {"inbound_nodes": [[["input_2", 0, 0, {}], ["conv1d_6", 0, 0, {}]]], "name": "add_3", "class_name": "Add", "config": {"trainable": true, "name": "add_3"}}, {"inbound_nodes": [[["input_1", 0, 0, {}], ["conv1d_2", 0, 0, {}]]], "name": "add_1", "class_name": "Add", "config": {"trainable": true, "name": "add_1"}}, {"inbound_nodes": [[["add_3", 0, 0, {}]]], "name": "batch_normalization_7", "class_name": "BatchNormalization", "config": {"trainable": true, "epsilon": 0.001, "beta_regularizer": null, "gamma_constraint": null, "name": "batch_normalization_7", "axis": -1, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "scale": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99, "gamma_regularizer": null, "beta_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "center": true}}, {"inbound_nodes": [[["add_1", 0, 0, {}]]], "name": "batch_normalization_3", "class_name": "BatchNormalization", "config": {"trainable": true, "epsilon": 0.001, "beta_regularizer": null, "gamma_constraint": null, "name": "batch_normalization_3", "axis": -1, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "scale": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99, "gamma_regularizer": null, "beta_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "center": true}}, {"inbound_nodes": [[["batch_normalization_7", 0, 0, {}]]], "name": "p_re_lu_7", "class_name": "PReLU", "config": {"trainable": true, "shared_axes": null, "alpha_regularizer": null, "name": "p_re_lu_7", "alpha_initializer": {"class_name": "Zeros", "config": {}}, "alpha_constraint": null}}, {"inbound_nodes": [[["batch_normalization_3", 0, 0, {}]]], "name": "p_re_lu_3", "class_name": "PReLU", "config": {"trainable": true, "shared_axes": null, "alpha_regularizer": null, "name": "p_re_lu_3", "alpha_initializer": {"class_name": "Zeros", "config": {}}, "alpha_constraint": null}}, {"inbound_nodes": [[["p_re_lu_7", 0, 0, {}]]], "name": "conv1d_7", "class_name": "Conv1D", "config": {"trainable": true, "activity_regularizer": null, "activation": "linear", "bias_regularizer": null, "kernel_size": [1], "kernel_regularizer": null, "dilation_rate": [1], "name": "conv1d_7", "kernel_constraint": null, "bias_constraint": null, "strides": [1], "use_bias": true, "filters": 192, "padding": "valid", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "normal", "mode": "fan_in", "scale": 2.0, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}}}, {"inbound_nodes": [[["p_re_lu_3", 0, 0, {}]]], "name": "conv1d_3", "class_name": "Conv1D", "config": {"trainable": true, "activity_regularizer": null, "activation": "linear", "bias_regularizer": null, "kernel_size": [1], "kernel_regularizer": null, "dilation_rate": [1], "name": "conv1d_3", "kernel_constraint": null, "bias_constraint": null, "strides": [1], "use_bias": true, "filters": 192, "padding": "valid", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "normal", "mode": "fan_in", "scale": 2.0, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}}}, {"inbound_nodes": [[["conv1d_7", 0, 0, {}]]], "name": "batch_normalization_8", "class_name": "BatchNormalization", "config": {"trainable": true, "epsilon": 0.001, "beta_regularizer": null, "gamma_constraint": null, "name": "batch_normalization_8", "axis": -1, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "scale": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99, "gamma_regularizer": null, "beta_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "center": true}}, {"inbound_nodes": [[["conv1d_3", 0, 0, {}]]], "name": "batch_normalization_4", "class_name": "BatchNormalization", "config": {"trainable": true, "epsilon": 0.001, "beta_regularizer": null, "gamma_constraint": null, "name": "batch_normalization_4", "axis": -1, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "scale": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99, "gamma_regularizer": null, "beta_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "center": true}}, {"inbound_nodes": [[["batch_normalization_8", 0, 0, {}]]], "name": "p_re_lu_8", "class_name": "PReLU", "config": {"trainable": true, "shared_axes": null, "alpha_regularizer": null, "name": "p_re_lu_8", "alpha_initializer": {"class_name": "Zeros", "config": {}}, "alpha_constraint": null}}, {"inbound_nodes": [[["batch_normalization_4", 0, 0, {}]]], "name": "p_re_lu_4", "class_name": "PReLU", "config": {"trainable": true, "shared_axes": null, "alpha_regularizer": null, "name": "p_re_lu_4", "alpha_initializer": {"class_name": "Zeros", "config": {}}, "alpha_constraint": null}}, {"inbound_nodes": [[["p_re_lu_8", 0, 0, {}]]], "name": "conv1d_8", "class_name": "Conv1D", "config": {"trainable": true, "activity_regularizer": null, "activation": "linear", "bias_regularizer": null, "kernel_size": [1], "kernel_regularizer": null, "dilation_rate": [1], "name": "conv1d_8", "kernel_constraint": null, "bias_constraint": null, "strides": [1], "use_bias": true, "filters": 20, "padding": "valid", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "normal", "mode": "fan_in", "scale": 2.0, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}}}, {"inbound_nodes": [[["p_re_lu_4", 0, 0, {}]]], "name": "conv1d_4", "class_name": "Conv1D", "config": {"trainable": true, "activity_regularizer": null, "activation": "linear", "bias_regularizer": null, "kernel_size": [1], "kernel_regularizer": null, "dilation_rate": [1], "name": "conv1d_4", "kernel_constraint": null, "bias_constraint": null, "strides": [1], "use_bias": true, "filters": 20, "padding": "valid", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "normal", "mode": "fan_in", "scale": 2.0, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}}}, {"inbound_nodes": [[["add_3", 0, 0, {}], ["conv1d_8", 0, 0, {}]]], "name": "add_4", "class_name": "Add", "config": {"trainable": true, "name": "add_4"}}, {"inbound_nodes": [[["add_1", 0, 0, {}], ["conv1d_4", 0, 0, {}]]], "name": "add_2", "class_name": "Add", "config": {"trainable": true, "name": "add_2"}}, {"inbound_nodes": [[["add_4", 0, 0, {}]]], "name": "gru_2", "class_name": "GRU", "config": {"trainable": true, "activity_regularizer": null, "activation": "tanh", "unroll": true, "units": 64, "kernel_constraint": null, "bias_constraint": null, "go_backwards": false, "use_bias": true, "recurrent_constraint": null, "recurrent_dropout": 0.2, "kernel_regularizer": null, "dropout": 0.2, "stateful": false, "recurrent_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "normal", "mode": "fan_in", "scale": 2.0, "seed": null}}, "bias_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "normal", "mode": "fan_in", "scale": 2.0, "seed": null}}, "bias_regularizer": null, "name": "gru_2", "return_sequences": false, "recurrent_activation": "hard_sigmoid", "recurrent_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "normal", "mode": "fan_in", "scale": 2.0, "seed": null}}, "implementation": 2}}, {"inbound_nodes": [[["add_2", 0, 0, {}]]], "name": "gru_1", "class_name": "GRU", "config": {"trainable": true, "activity_regularizer": null, "activation": "tanh", "unroll": true, "units": 64, "kernel_constraint": null, "bias_constraint": null, "go_backwards": false, "use_bias": true, "recurrent_constraint": null, "recurrent_dropout": 0.2, "kernel_regularizer": null, "dropout": 0.2, "stateful": false, "recurrent_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "normal", "mode": "fan_in", "scale": 2.0, "seed": null}}, "bias_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "normal", "mode": "fan_in", "scale": 2.0, "seed": null}}, "bias_regularizer": null, "name": "gru_1", "return_sequences": false, "recurrent_activation": "hard_sigmoid", "recurrent_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "normal", "mode": "fan_in", "scale": 2.0, "seed": null}}, "implementation": 2}}, {"inbound_nodes": [[["gru_2", 0, 0, {}], ["gru_1", 0, 0, {}]]], "name": "concatenate_1", "class_name": "Concatenate", "config": {"trainable": true, "axis": -1, "name": "concatenate_1"}}, {"inbound_nodes": [[["concatenate_1", 0, 0, {}]]], "name": "dense_1", "class_name": "Dense", "config": {"trainable": true, "activity_regularizer": null, "activation": "linear", "bias_regularizer": null, "name": "dense_1", "units": 64, "kernel_regularizer": null, "bias_constraint": null, "kernel_constraint": null, "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "normal", "mode": "fan_in", "scale": 2.0, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}}}, {"inbound_nodes": [[["dense_1", 0, 0, {}]]], "name": "batch_normalization_9", "class_name": "BatchNormalization", "config": {"trainable": true, "epsilon": 0.001, "beta_regularizer": null, "gamma_constraint": null, "name": "batch_normalization_9", "axis": -1, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "scale": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99, "gamma_regularizer": null, "beta_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "center": true}}, {"inbound_nodes": [[["batch_normalization_9", 0, 0, {}]]], "name": "p_re_lu_9", "class_name": "PReLU", "config": {"trainable": true, "shared_axes": null, "alpha_regularizer": null, "name": "p_re_lu_9", "alpha_initializer": {"class_name": "Zeros", "config": {}}, "alpha_constraint": null}}, {"inbound_nodes": [[["p_re_lu_9", 0, 0, {}]]], "name": "dropout_1", "class_name": "Dropout", "config": {"trainable": true, "rate": 0.3, "name": "dropout_1"}}, {"inbound_nodes": [[["dropout_1", 0, 0, {}]]], "name": "dense_2", "class_name": "Dense", "config": {"trainable": true, "activity_regularizer": null, "activation": "linear", "bias_regularizer": null, "name": "dense_2", "units": 64, "kernel_regularizer": null, "bias_constraint": null, "kernel_constraint": null, "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "normal", "mode": "fan_in", "scale": 2.0, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}}}, {"inbound_nodes": [[["dense_2", 0, 0, {}]]], "name": "batch_normalization_10", "class_name": "BatchNormalization", "config": {"trainable": true, "epsilon": 0.001, "beta_regularizer": null, "gamma_constraint": null, "name": "batch_normalization_10", "axis": -1, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "scale": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99, "gamma_regularizer": null, "beta_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "center": true}}, {"inbound_nodes": [[["batch_normalization_10", 0, 0, {}]]], "name": "p_re_lu_10", "class_name": "PReLU", "config": {"trainable": true, "shared_axes": null, "alpha_regularizer": null, "name": "p_re_lu_10", "alpha_initializer": {"class_name": "Zeros", "config": {}}, "alpha_constraint": null}}, {"inbound_nodes": [[["p_re_lu_10", 0, 0, {}]]], "name": "dropout_2", "class_name": "Dropout", "config": {"trainable": true, "rate": 0.3, "name": "dropout_2"}}, {"inbound_nodes": [[["dropout_2", 0, 0, {}]]], "name": "dense_3", "class_name": "Dense", "config": {"trainable": true, "activity_regularizer": null, "activation": "linear", "bias_regularizer": null, "name": "dense_3", "units": 1, "kernel_regularizer": null, "bias_constraint": null, "kernel_constraint": null, "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}}}, {"inbound_nodes": [[["dense_3", 0, 0, {}]]], "name": "p_re_lu_11", "class_name": "PReLU", "config": {"trainable": true, "shared_axes": null, "alpha_regularizer": null, "name": "p_re_lu_11", "alpha_initializer": {"class_name": "Zeros", "config": {}}, "alpha_constraint": null}}], "input_layers": [["input_1", 0, 0], ["input_2", 0, 0]], "output_layers": [["p_re_lu_11", 0, 0]], "name": "model_1"}}