{"keras_version": "2.0.3", "config": {"name": "model_1", "layers": [{"name": "input_2", "inbound_nodes": [], "config": {"name": "input_2", "batch_input_shape": [null, 9, 20], "dtype": "float32", "sparse": false}, "class_name": "InputLayer"}, {"name": "input_1", "inbound_nodes": [], "config": {"name": "input_1", "batch_input_shape": [null, 34, 20], "dtype": "float32", "sparse": false}, "class_name": "InputLayer"}, {"name": "batch_normalization_3", "inbound_nodes": [[["input_2", 0, 0, {}]]], "config": {"name": "batch_normalization_3", "gamma_regularizer": null, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "beta_constraint": null, "gamma_constraint": null, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "epsilon": 0.001, "trainable": true, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "scale": true, "axis": -1, "center": true, "beta_regularizer": null, "momentum": 0.99}, "class_name": "BatchNormalization"}, {"name": "batch_normalization_1", "inbound_nodes": [[["input_1", 0, 0, {}]]], "config": {"name": "batch_normalization_1", "gamma_regularizer": null, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "beta_constraint": null, "gamma_constraint": null, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "epsilon": 0.001, "trainable": true, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "scale": true, "axis": -1, "center": true, "beta_regularizer": null, "momentum": 0.99}, "class_name": "BatchNormalization"}, {"name": "p_re_lu_3", "inbound_nodes": [[["batch_normalization_3", 0, 0, {}]]], "config": {"name": "p_re_lu_3", "alpha_initializer": {"config": {}, "class_name": "Zeros"}, "alpha_constraint": null, "trainable": true, "shared_axes": null, "alpha_regularizer": null}, "class_name": "PReLU"}, {"name": "p_re_lu_1", "inbound_nodes": [[["batch_normalization_1", 0, 0, {}]]], "config": {"name": "p_re_lu_1", "alpha_initializer": {"config": {}, "class_name": "Zeros"}, "alpha_constraint": null, "trainable": true, "shared_axes": null, "alpha_regularizer": null}, "class_name": "PReLU"}, {"name": "conv1d_3", "inbound_nodes": [[["p_re_lu_3", 0, 0, {}]]], "config": {"name": "conv1d_3", "activation": "linear", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_constraint": null, "strides": [1], "kernel_initializer": {"config": {"seed": null, "scale": 2.0, "mode": "fan_in", "distribution": "normal"}, "class_name": "VarianceScaling"}, "trainable": true, "kernel_size": [1], "filters": 192, "use_bias": true, "padding": "valid", "bias_regularizer": null, "kernel_regularizer": null, "activity_regularizer": null, "dilation_rate": [1], "kernel_constraint": null}, "class_name": "Conv1D"}, {"name": "conv1d_1", "inbound_nodes": [[["p_re_lu_1", 0, 0, {}]]], "config": {"name": "conv1d_1", "activation": "linear", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_constraint": null, "strides": [1], "kernel_initializer": {"config": {"seed": null, "scale": 2.0, "mode": "fan_in", "distribution": "normal"}, "class_name": "VarianceScaling"}, "trainable": true, "kernel_size": [1], "filters": 192, "use_bias": true, "padding": "valid", "bias_regularizer": null, "kernel_regularizer": null, "activity_regularizer": null, "dilation_rate": [1], "kernel_constraint": null}, "class_name": "Conv1D"}, {"name": "batch_normalization_4", "inbound_nodes": [[["conv1d_3", 0, 0, {}]]], "config": {"name": "batch_normalization_4", "gamma_regularizer": null, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "beta_constraint": null, "gamma_constraint": null, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "epsilon": 0.001, "trainable": true, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "scale": true, "axis": -1, "center": true, "beta_regularizer": null, "momentum": 0.99}, "class_name": "BatchNormalization"}, {"name": "batch_normalization_2", "inbound_nodes": [[["conv1d_1", 0, 0, {}]]], "config": {"name": "batch_normalization_2", "gamma_regularizer": null, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "beta_constraint": null, "gamma_constraint": null, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "epsilon": 0.001, "trainable": true, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "scale": true, "axis": -1, "center": true, "beta_regularizer": null, "momentum": 0.99}, "class_name": "BatchNormalization"}, {"name": "p_re_lu_4", "inbound_nodes": [[["batch_normalization_4", 0, 0, {}]]], "config": {"name": "p_re_lu_4", "alpha_initializer": {"config": {}, "class_name": "Zeros"}, "alpha_constraint": null, "trainable": true, "shared_axes": null, "alpha_regularizer": null}, "class_name": "PReLU"}, {"name": "p_re_lu_2", "inbound_nodes": [[["batch_normalization_2", 0, 0, {}]]], "config": {"name": "p_re_lu_2", "alpha_initializer": {"config": {}, "class_name": "Zeros"}, "alpha_constraint": null, "trainable": true, "shared_axes": null, "alpha_regularizer": null}, "class_name": "PReLU"}, {"name": "conv1d_4", "inbound_nodes": [[["p_re_lu_4", 0, 0, {}]]], "config": {"name": "conv1d_4", "activation": "linear", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_constraint": null, "strides": [1], "kernel_initializer": {"config": {"seed": null, "scale": 2.0, "mode": "fan_in", "distribution": "normal"}, "class_name": "VarianceScaling"}, "trainable": true, "kernel_size": [1], "filters": 20, "use_bias": true, "padding": "valid", "bias_regularizer": null, "kernel_regularizer": null, "activity_regularizer": null, "dilation_rate": [1], "kernel_constraint": null}, "class_name": "Conv1D"}, {"name": "conv1d_2", "inbound_nodes": [[["p_re_lu_2", 0, 0, {}]]], "config": {"name": "conv1d_2", "activation": "linear", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_constraint": null, "strides": [1], "kernel_initializer": {"config": {"seed": null, "scale": 2.0, "mode": "fan_in", "distribution": "normal"}, "class_name": "VarianceScaling"}, "trainable": true, "kernel_size": [1], "filters": 20, "use_bias": true, "padding": "valid", "bias_regularizer": null, "kernel_regularizer": null, "activity_regularizer": null, "dilation_rate": [1], "kernel_constraint": null}, "class_name": "Conv1D"}, {"name": "add_2", "inbound_nodes": [[["input_2", 0, 0, {}], ["conv1d_4", 0, 0, {}]]], "config": {"name": "add_2", "trainable": true}, "class_name": "Add"}, {"name": "add_1", "inbound_nodes": [[["input_1", 0, 0, {}], ["conv1d_2", 0, 0, {}]]], "config": {"name": "add_1", "trainable": true}, "class_name": "Add"}, {"name": "gru_2", "inbound_nodes": [[["add_2", 0, 0, {}]]], "config": {"units": 32, "bias_initializer": {"config": {"seed": null, "scale": 2.0, "mode": "fan_in", "distribution": "normal"}, "class_name": "VarianceScaling"}, "bias_constraint": null, "activity_regularizer": null, "implementation": 2, "name": "gru_2", "go_backwards": false, "stateful": false, "kernel_regularizer": null, "unroll": true, "return_sequences": false, "bias_regularizer": null, "dropout": 0.2, "recurrent_constraint": null, "activation": "tanh", "kernel_initializer": {"config": {"seed": null, "scale": 2.0, "mode": "fan_in", "distribution": "normal"}, "class_name": "VarianceScaling"}, "recurrent_initializer": {"config": {"seed": null, "scale": 2.0, "mode": "fan_in", "distribution": "normal"}, "class_name": "VarianceScaling"}, "recurrent_dropout": 0.2, "recurrent_regularizer": null, "trainable": true, "kernel_constraint": null, "use_bias": true, "recurrent_activation": "hard_sigmoid"}, "class_name": "GRU"}, {"name": "gru_1", "inbound_nodes": [[["add_1", 0, 0, {}]]], "config": {"units": 32, "bias_initializer": {"config": {"seed": null, "scale": 2.0, "mode": "fan_in", "distribution": "normal"}, "class_name": "VarianceScaling"}, "bias_constraint": null, "activity_regularizer": null, "implementation": 2, "name": "gru_1", "go_backwards": false, "stateful": false, "kernel_regularizer": null, "unroll": true, "return_sequences": false, "bias_regularizer": null, "dropout": 0.2, "recurrent_constraint": null, "activation": "tanh", "kernel_initializer": {"config": {"seed": null, "scale": 2.0, "mode": "fan_in", "distribution": "normal"}, "class_name": "VarianceScaling"}, "recurrent_initializer": {"config": {"seed": null, "scale": 2.0, "mode": "fan_in", "distribution": "normal"}, "class_name": "VarianceScaling"}, "recurrent_dropout": 0.2, "recurrent_regularizer": null, "trainable": true, "kernel_constraint": null, "use_bias": true, "recurrent_activation": "hard_sigmoid"}, "class_name": "GRU"}, {"name": "concatenate_1", "inbound_nodes": [[["gru_2", 0, 0, {}], ["gru_1", 0, 0, {}]]], "config": {"name": "concatenate_1", "axis": -1, "trainable": true}, "class_name": "Concatenate"}, {"name": "dense_1", "inbound_nodes": [[["concatenate_1", 0, 0, {}]]], "config": {"name": "dense_1", "units": 64, "activation": "linear", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_constraint": null, "kernel_initializer": {"config": {"seed": null, "scale": 2.0, "mode": "fan_in", "distribution": "normal"}, "class_name": "VarianceScaling"}, "trainable": true, "kernel_regularizer": null, "bias_regularizer": null, "use_bias": true, "activity_regularizer": null, "kernel_constraint": null}, "class_name": "Dense"}, {"name": "batch_normalization_5", "inbound_nodes": [[["dense_1", 0, 0, {}]]], "config": {"name": "batch_normalization_5", "gamma_regularizer": null, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "beta_constraint": null, "gamma_constraint": null, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "epsilon": 0.001, "trainable": true, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "scale": true, "axis": -1, "center": true, "beta_regularizer": null, "momentum": 0.99}, "class_name": "BatchNormalization"}, {"name": "p_re_lu_5", "inbound_nodes": [[["batch_normalization_5", 0, 0, {}]]], "config": {"name": "p_re_lu_5", "alpha_initializer": {"config": {}, "class_name": "Zeros"}, "alpha_constraint": null, "trainable": true, "shared_axes": null, "alpha_regularizer": null}, "class_name": "PReLU"}, {"name": "dropout_1", "inbound_nodes": [[["p_re_lu_5", 0, 0, {}]]], "config": {"name": "dropout_1", "rate": 0.3, "trainable": true}, "class_name": "Dropout"}, {"name": "dense_2", "inbound_nodes": [[["dropout_1", 0, 0, {}]]], "config": {"name": "dense_2", "units": 64, "activation": "linear", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_constraint": null, "kernel_initializer": {"config": {"seed": null, "scale": 2.0, "mode": "fan_in", "distribution": "normal"}, "class_name": "VarianceScaling"}, "trainable": true, "kernel_regularizer": null, "bias_regularizer": null, "use_bias": true, "activity_regularizer": null, "kernel_constraint": null}, "class_name": "Dense"}, {"name": "batch_normalization_6", "inbound_nodes": [[["dense_2", 0, 0, {}]]], "config": {"name": "batch_normalization_6", "gamma_regularizer": null, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "beta_constraint": null, "gamma_constraint": null, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "epsilon": 0.001, "trainable": true, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "scale": true, "axis": -1, "center": true, "beta_regularizer": null, "momentum": 0.99}, "class_name": "BatchNormalization"}, {"name": "p_re_lu_6", "inbound_nodes": [[["batch_normalization_6", 0, 0, {}]]], "config": {"name": "p_re_lu_6", "alpha_initializer": {"config": {}, "class_name": "Zeros"}, "alpha_constraint": null, "trainable": true, "shared_axes": null, "alpha_regularizer": null}, "class_name": "PReLU"}, {"name": "dropout_2", "inbound_nodes": [[["p_re_lu_6", 0, 0, {}]]], "config": {"name": "dropout_2", "rate": 0.3, "trainable": true}, "class_name": "Dropout"}, {"name": "dense_3", "inbound_nodes": [[["dropout_2", 0, 0, {}]]], "config": {"name": "dense_3", "units": 1, "activation": "linear", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_constraint": null, "kernel_initializer": {"config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}, "class_name": "VarianceScaling"}, "trainable": true, "kernel_regularizer": null, "bias_regularizer": null, "use_bias": true, "activity_regularizer": null, "kernel_constraint": null}, "class_name": "Dense"}, {"name": "p_re_lu_7", "inbound_nodes": [[["dense_3", 0, 0, {}]]], "config": {"name": "p_re_lu_7", "alpha_initializer": {"config": {}, "class_name": "Zeros"}, "alpha_constraint": null, "trainable": true, "shared_axes": null, "alpha_regularizer": null}, "class_name": "PReLU"}], "input_layers": [["input_1", 0, 0], ["input_2", 0, 0]], "output_layers": [["p_re_lu_7", 0, 0]]}, "class_name": "Model", "backend": "theano"}