{"keras_version": "2.0.3", "backend": "theano", "config": {"layers": [{"name": "input_2", "config": {"name": "input_2", "sparse": false, "dtype": "float32", "batch_input_shape": [null, 9, 20]}, "inbound_nodes": [], "class_name": "InputLayer"}, {"name": "input_1", "config": {"name": "input_1", "sparse": false, "dtype": "float32", "batch_input_shape": [null, 34, 20]}, "inbound_nodes": [], "class_name": "InputLayer"}, {"name": "batch_normalization_3", "config": {"beta_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "scale": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "momentum": 0.99, "center": true, "beta_constraint": null, "axis": -1, "name": "batch_normalization_3", "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "epsilon": 0.001, "gamma_regularizer": null}, "inbound_nodes": [[["input_2", 0, 0, {}]]], "class_name": "BatchNormalization"}, {"name": "batch_normalization_1", "config": {"beta_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "scale": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "momentum": 0.99, "center": true, "beta_constraint": null, "axis": -1, "name": "batch_normalization_1", "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "epsilon": 0.001, "gamma_regularizer": null}, "inbound_nodes": [[["input_1", 0, 0, {}]]], "class_name": "BatchNormalization"}, {"name": "p_re_lu_3", "config": {"trainable": true, "shared_axes": null, "alpha_initializer": {"class_name": "Zeros", "config": {}}, "name": "p_re_lu_3", "alpha_constraint": null, "alpha_regularizer": null}, "inbound_nodes": [[["batch_normalization_3", 0, 0, {}]]], "class_name": "PReLU"}, {"name": "p_re_lu_1", "config": {"trainable": true, "shared_axes": null, "alpha_initializer": {"class_name": "Zeros", "config": {}}, "name": "p_re_lu_1", "alpha_constraint": null, "alpha_regularizer": null}, "inbound_nodes": [[["batch_normalization_1", 0, 0, {}]]], "class_name": "PReLU"}, {"name": "conv1d_3", "config": {"kernel_regularizer": null, "trainable": true, "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 2.0, "mode": "fan_in", "distribution": "normal"}}, "strides": [1], "bias_regularizer": null, "filters": 192, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "dilation_rate": [1], "padding": "valid", "activation": "linear", "kernel_size": [1], "activity_regularizer": null, "name": "conv1d_3", "use_bias": true}, "inbound_nodes": [[["p_re_lu_3", 0, 0, {}]]], "class_name": "Conv1D"}, {"name": "conv1d_1", "config": {"kernel_regularizer": null, "trainable": true, "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 2.0, "mode": "fan_in", "distribution": "normal"}}, "strides": [1], "bias_regularizer": null, "filters": 192, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "dilation_rate": [1], "padding": "valid", "activation": "linear", "kernel_size": [1], "activity_regularizer": null, "name": "conv1d_1", "use_bias": true}, "inbound_nodes": [[["p_re_lu_1", 0, 0, {}]]], "class_name": "Conv1D"}, {"name": "batch_normalization_4", "config": {"beta_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "scale": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "momentum": 0.99, "center": true, "beta_constraint": null, "axis": -1, "name": "batch_normalization_4", "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "epsilon": 0.001, "gamma_regularizer": null}, "inbound_nodes": [[["conv1d_3", 0, 0, {}]]], "class_name": "BatchNormalization"}, {"name": "batch_normalization_2", "config": {"beta_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "scale": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "momentum": 0.99, "center": true, "beta_constraint": null, "axis": -1, "name": "batch_normalization_2", "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "epsilon": 0.001, "gamma_regularizer": null}, "inbound_nodes": [[["conv1d_1", 0, 0, {}]]], "class_name": "BatchNormalization"}, {"name": "p_re_lu_4", "config": {"trainable": true, "shared_axes": null, "alpha_initializer": {"class_name": "Zeros", "config": {}}, "name": "p_re_lu_4", "alpha_constraint": null, "alpha_regularizer": null}, "inbound_nodes": [[["batch_normalization_4", 0, 0, {}]]], "class_name": "PReLU"}, {"name": "p_re_lu_2", "config": {"trainable": true, "shared_axes": null, "alpha_initializer": {"class_name": "Zeros", "config": {}}, "name": "p_re_lu_2", "alpha_constraint": null, "alpha_regularizer": null}, "inbound_nodes": [[["batch_normalization_2", 0, 0, {}]]], "class_name": "PReLU"}, {"name": "conv1d_4", "config": {"kernel_regularizer": null, "trainable": true, "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 2.0, "mode": "fan_in", "distribution": "normal"}}, "strides": [1], "bias_regularizer": null, "filters": 20, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "dilation_rate": [1], "padding": "valid", "activation": "linear", "kernel_size": [1], "activity_regularizer": null, "name": "conv1d_4", "use_bias": true}, "inbound_nodes": [[["p_re_lu_4", 0, 0, {}]]], "class_name": "Conv1D"}, {"name": "conv1d_2", "config": {"kernel_regularizer": null, "trainable": true, "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 2.0, "mode": "fan_in", "distribution": "normal"}}, "strides": [1], "bias_regularizer": null, "filters": 20, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "dilation_rate": [1], "padding": "valid", "activation": "linear", "kernel_size": [1], "activity_regularizer": null, "name": "conv1d_2", "use_bias": true}, "inbound_nodes": [[["p_re_lu_2", 0, 0, {}]]], "class_name": "Conv1D"}, {"name": "add_2", "config": {"name": "add_2", "trainable": true}, "inbound_nodes": [[["input_2", 0, 0, {}], ["conv1d_4", 0, 0, {}]]], "class_name": "Add"}, {"name": "add_1", "config": {"name": "add_1", "trainable": true}, "inbound_nodes": [[["input_1", 0, 0, {}], ["conv1d_2", 0, 0, {}]]], "class_name": "Add"}, {"name": "flatten_2", "config": {"name": "flatten_2", "trainable": true}, "inbound_nodes": [[["add_2", 0, 0, {}]]], "class_name": "Flatten"}, {"name": "flatten_1", "config": {"name": "flatten_1", "trainable": true}, "inbound_nodes": [[["add_1", 0, 0, {}]]], "class_name": "Flatten"}, {"name": "concatenate_1", "config": {"axis": -1, "name": "concatenate_1", "trainable": true}, "inbound_nodes": [[["flatten_2", 0, 0, {}], ["flatten_1", 0, 0, {}]]], "class_name": "Concatenate"}, {"name": "dense_1", "config": {"kernel_regularizer": null, "trainable": true, "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 2.0, "mode": "fan_in", "distribution": "normal"}}, "activation": "linear", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "activity_regularizer": null, "bias_regularizer": null, "name": "dense_1", "units": 64, "use_bias": true}, "inbound_nodes": [[["concatenate_1", 0, 0, {}]]], "class_name": "Dense"}, {"name": "batch_normalization_5", "config": {"beta_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "scale": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "momentum": 0.99, "center": true, "beta_constraint": null, "axis": -1, "name": "batch_normalization_5", "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "epsilon": 0.001, "gamma_regularizer": null}, "inbound_nodes": [[["dense_1", 0, 0, {}]]], "class_name": "BatchNormalization"}, {"name": "p_re_lu_5", "config": {"trainable": true, "shared_axes": null, "alpha_initializer": {"class_name": "Zeros", "config": {}}, "name": "p_re_lu_5", "alpha_constraint": null, "alpha_regularizer": null}, "inbound_nodes": [[["batch_normalization_5", 0, 0, {}]]], "class_name": "PReLU"}, {"name": "dropout_1", "config": {"name": "dropout_1", "trainable": true, "rate": 0.3}, "inbound_nodes": [[["p_re_lu_5", 0, 0, {}]]], "class_name": "Dropout"}, {"name": "dense_2", "config": {"kernel_regularizer": null, "trainable": true, "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 2.0, "mode": "fan_in", "distribution": "normal"}}, "activation": "linear", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "activity_regularizer": null, "bias_regularizer": null, "name": "dense_2", "units": 64, "use_bias": true}, "inbound_nodes": [[["dropout_1", 0, 0, {}]]], "class_name": "Dense"}, {"name": "batch_normalization_6", "config": {"beta_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "scale": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "momentum": 0.99, "center": true, "beta_constraint": null, "axis": -1, "name": "batch_normalization_6", "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "epsilon": 0.001, "gamma_regularizer": null}, "inbound_nodes": [[["dense_2", 0, 0, {}]]], "class_name": "BatchNormalization"}, {"name": "p_re_lu_6", "config": {"trainable": true, "shared_axes": null, "alpha_initializer": {"class_name": "Zeros", "config": {}}, "name": "p_re_lu_6", "alpha_constraint": null, "alpha_regularizer": null}, "inbound_nodes": [[["batch_normalization_6", 0, 0, {}]]], "class_name": "PReLU"}, {"name": "dropout_2", "config": {"name": "dropout_2", "trainable": true, "rate": 0.3}, "inbound_nodes": [[["p_re_lu_6", 0, 0, {}]]], "class_name": "Dropout"}, {"name": "dense_3", "config": {"kernel_regularizer": null, "trainable": true, "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}}, "activation": "linear", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "activity_regularizer": null, "bias_regularizer": null, "name": "dense_3", "units": 1, "use_bias": true}, "inbound_nodes": [[["dropout_2", 0, 0, {}]]], "class_name": "Dense"}, {"name": "p_re_lu_7", "config": {"trainable": true, "shared_axes": null, "alpha_initializer": {"class_name": "Zeros", "config": {}}, "name": "p_re_lu_7", "alpha_constraint": null, "alpha_regularizer": null}, "inbound_nodes": [[["dense_3", 0, 0, {}]]], "class_name": "PReLU"}], "name": "model_1", "output_layers": [["p_re_lu_7", 0, 0]], "input_layers": [["input_1", 0, 0], ["input_2", 0, 0]]}, "class_name": "Model"}