{"keras_version": "2.0.3", "backend": "theano", "class_name": "Model", "config": {"output_layers": [["p_re_lu_9", 0, 0]], "name": "model_1", "input_layers": [["input_1", 0, 0], ["input_2", 0, 0]], "layers": [{"inbound_nodes": [], "name": "input_2", "class_name": "InputLayer", "config": {"dtype": "float32", "name": "input_2", "sparse": false, "batch_input_shape": [null, 9, 50]}}, {"inbound_nodes": [], "name": "input_1", "class_name": "InputLayer", "config": {"dtype": "float32", "name": "input_1", "sparse": false, "batch_input_shape": [null, 48, 50]}}, {"inbound_nodes": [[["input_2", 0, 0, {}]]], "name": "batch_normalization_4", "class_name": "BatchNormalization", "config": {"momentum": 0.99, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "trainable": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "epsilon": 0.001, "center": true, "axis": -1, "beta_constraint": null, "scale": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "name": "batch_normalization_4", "gamma_regularizer": null, "beta_regularizer": null}}, {"inbound_nodes": [[["input_1", 0, 0, {}]]], "name": "batch_normalization_1", "class_name": "BatchNormalization", "config": {"momentum": 0.99, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "trainable": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "epsilon": 0.001, "center": true, "axis": -1, "beta_constraint": null, "scale": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "name": "batch_normalization_1", "gamma_regularizer": null, "beta_regularizer": null}}, {"inbound_nodes": [[["batch_normalization_4", 0, 0, {}]]], "name": "p_re_lu_4", "class_name": "PReLU", "config": {"shared_axes": null, "alpha_constraint": null, "trainable": true, "alpha_regularizer": null, "alpha_initializer": {"class_name": "Zeros", "config": {}}, "name": "p_re_lu_4"}}, {"inbound_nodes": [[["batch_normalization_1", 0, 0, {}]]], "name": "p_re_lu_1", "class_name": "PReLU", "config": {"shared_axes": null, "alpha_constraint": null, "trainable": true, "alpha_regularizer": null, "alpha_initializer": {"class_name": "Zeros", "config": {}}, "name": "p_re_lu_1"}}, {"inbound_nodes": [[["p_re_lu_4", 0, 0, {}]]], "name": "dropout_4", "class_name": "Dropout", "config": {"name": "dropout_4", "trainable": true, "rate": 0.3}}, {"inbound_nodes": [[["p_re_lu_1", 0, 0, {}]]], "name": "dropout_1", "class_name": "Dropout", "config": {"name": "dropout_1", "trainable": true, "rate": 0.3}}, {"inbound_nodes": [[["dropout_4", 0, 0, {}]]], "name": "conv1d_4", "class_name": "Conv1D", "config": {"kernel_constraint": null, "name": "conv1d_4", "bias_constraint": null, "dilation_rate": [1], "trainable": true, "kernel_size": [1], "strides": [1], "use_bias": true, "padding": "valid", "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "seed": null, "mode": "fan_in", "distribution": "normal"}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 192, "activation": "linear", "kernel_regularizer": null, "activity_regularizer": null}}, {"inbound_nodes": [[["dropout_1", 0, 0, {}]]], "name": "conv1d_1", "class_name": "Conv1D", "config": {"kernel_constraint": null, "name": "conv1d_1", "bias_constraint": null, "dilation_rate": [1], "trainable": true, "kernel_size": [1], "strides": [1], "use_bias": true, "padding": "valid", "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "seed": null, "mode": "fan_in", "distribution": "normal"}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 192, "activation": "linear", "kernel_regularizer": null, "activity_regularizer": null}}, {"inbound_nodes": [[["conv1d_4", 0, 0, {}]]], "name": "batch_normalization_5", "class_name": "BatchNormalization", "config": {"momentum": 0.99, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "trainable": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "epsilon": 0.001, "center": true, "axis": -1, "beta_constraint": null, "scale": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "name": "batch_normalization_5", "gamma_regularizer": null, "beta_regularizer": null}}, {"inbound_nodes": [[["conv1d_1", 0, 0, {}]]], "name": "batch_normalization_2", "class_name": "BatchNormalization", "config": {"momentum": 0.99, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "trainable": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "epsilon": 0.001, "center": true, "axis": -1, "beta_constraint": null, "scale": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "name": "batch_normalization_2", "gamma_regularizer": null, "beta_regularizer": null}}, {"inbound_nodes": [[["batch_normalization_5", 0, 0, {}]]], "name": "p_re_lu_5", "class_name": "PReLU", "config": {"shared_axes": null, "alpha_constraint": null, "trainable": true, "alpha_regularizer": null, "alpha_initializer": {"class_name": "Zeros", "config": {}}, "name": "p_re_lu_5"}}, {"inbound_nodes": [[["batch_normalization_2", 0, 0, {}]]], "name": "p_re_lu_2", "class_name": "PReLU", "config": {"shared_axes": null, "alpha_constraint": null, "trainable": true, "alpha_regularizer": null, "alpha_initializer": {"class_name": "Zeros", "config": {}}, "name": "p_re_lu_2"}}, {"inbound_nodes": [[["p_re_lu_5", 0, 0, {}]]], "name": "dropout_5", "class_name": "Dropout", "config": {"name": "dropout_5", "trainable": true, "rate": 0.3}}, {"inbound_nodes": [[["p_re_lu_2", 0, 0, {}]]], "name": "dropout_2", "class_name": "Dropout", "config": {"name": "dropout_2", "trainable": true, "rate": 0.3}}, {"inbound_nodes": [[["dropout_5", 0, 0, {}]]], "name": "conv1d_5", "class_name": "Conv1D", "config": {"kernel_constraint": null, "name": "conv1d_5", "bias_constraint": null, "dilation_rate": [1], "trainable": true, "kernel_size": [1], "strides": [1], "use_bias": true, "padding": "valid", "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "seed": null, "mode": "fan_in", "distribution": "normal"}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 128, "activation": "linear", "kernel_regularizer": null, "activity_regularizer": null}}, {"inbound_nodes": [[["dropout_2", 0, 0, {}]]], "name": "conv1d_2", "class_name": "Conv1D", "config": {"kernel_constraint": null, "name": "conv1d_2", "bias_constraint": null, "dilation_rate": [1], "trainable": true, "kernel_size": [1], "strides": [1], "use_bias": true, "padding": "valid", "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "seed": null, "mode": "fan_in", "distribution": "normal"}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 128, "activation": "linear", "kernel_regularizer": null, "activity_regularizer": null}}, {"inbound_nodes": [[["conv1d_5", 0, 0, {}]]], "name": "batch_normalization_6", "class_name": "BatchNormalization", "config": {"momentum": 0.99, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "trainable": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "epsilon": 0.001, "center": true, "axis": -1, "beta_constraint": null, "scale": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "name": "batch_normalization_6", "gamma_regularizer": null, "beta_regularizer": null}}, {"inbound_nodes": [[["conv1d_2", 0, 0, {}]]], "name": "batch_normalization_3", "class_name": "BatchNormalization", "config": {"momentum": 0.99, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "trainable": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "epsilon": 0.001, "center": true, "axis": -1, "beta_constraint": null, "scale": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "name": "batch_normalization_3", "gamma_regularizer": null, "beta_regularizer": null}}, {"inbound_nodes": [[["batch_normalization_6", 0, 0, {}]]], "name": "p_re_lu_6", "class_name": "PReLU", "config": {"shared_axes": null, "alpha_constraint": null, "trainable": true, "alpha_regularizer": null, "alpha_initializer": {"class_name": "Zeros", "config": {}}, "name": "p_re_lu_6"}}, {"inbound_nodes": [[["batch_normalization_3", 0, 0, {}]]], "name": "p_re_lu_3", "class_name": "PReLU", "config": {"shared_axes": null, "alpha_constraint": null, "trainable": true, "alpha_regularizer": null, "alpha_initializer": {"class_name": "Zeros", "config": {}}, "name": "p_re_lu_3"}}, {"inbound_nodes": [[["p_re_lu_6", 0, 0, {}]]], "name": "dropout_6", "class_name": "Dropout", "config": {"name": "dropout_6", "trainable": true, "rate": 0.3}}, {"inbound_nodes": [[["p_re_lu_3", 0, 0, {}]]], "name": "dropout_3", "class_name": "Dropout", "config": {"name": "dropout_3", "trainable": true, "rate": 0.3}}, {"inbound_nodes": [[["dropout_6", 0, 0, {}]]], "name": "conv1d_6", "class_name": "Conv1D", "config": {"kernel_constraint": null, "name": "conv1d_6", "bias_constraint": null, "dilation_rate": [1], "trainable": true, "kernel_size": [1], "strides": [1], "use_bias": true, "padding": "valid", "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "seed": null, "mode": "fan_in", "distribution": "normal"}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 50, "activation": "linear", "kernel_regularizer": null, "activity_regularizer": null}}, {"inbound_nodes": [[["dropout_3", 0, 0, {}]]], "name": "conv1d_3", "class_name": "Conv1D", "config": {"kernel_constraint": null, "name": "conv1d_3", "bias_constraint": null, "dilation_rate": [1], "trainable": true, "kernel_size": [1], "strides": [1], "use_bias": true, "padding": "valid", "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "seed": null, "mode": "fan_in", "distribution": "normal"}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 50, "activation": "linear", "kernel_regularizer": null, "activity_regularizer": null}}, {"inbound_nodes": [[["input_2", 0, 0, {}], ["conv1d_6", 0, 0, {}]]], "name": "add_2", "class_name": "Add", "config": {"name": "add_2", "trainable": true}}, {"inbound_nodes": [[["input_1", 0, 0, {}], ["conv1d_3", 0, 0, {}]]], "name": "add_1", "class_name": "Add", "config": {"name": "add_1", "trainable": true}}, {"inbound_nodes": [[["add_2", 0, 0, {}]]], "name": "flatten_2", "class_name": "Flatten", "config": {"name": "flatten_2", "trainable": true}}, {"inbound_nodes": [[["add_1", 0, 0, {}]]], "name": "flatten_1", "class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true}}, {"inbound_nodes": [[["flatten_2", 0, 0, {}], ["flatten_1", 0, 0, {}]]], "name": "concatenate_1", "class_name": "Concatenate", "config": {"axis": -1, "name": "concatenate_1", "trainable": true}}, {"inbound_nodes": [[["concatenate_1", 0, 0, {}]]], "name": "dense_1", "class_name": "Dense", "config": {"kernel_constraint": null, "name": "dense_1", "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "kernel_regularizer": null, "use_bias": true, "units": 64, "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "seed": null, "mode": "fan_in", "distribution": "normal"}}, "activation": "linear", "activity_regularizer": null}}, {"inbound_nodes": [[["dense_1", 0, 0, {}]]], "name": "batch_normalization_7", "class_name": "BatchNormalization", "config": {"momentum": 0.99, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "trainable": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "epsilon": 0.001, "center": true, "axis": -1, "beta_constraint": null, "scale": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "name": "batch_normalization_7", "gamma_regularizer": null, "beta_regularizer": null}}, {"inbound_nodes": [[["batch_normalization_7", 0, 0, {}]]], "name": "p_re_lu_7", "class_name": "PReLU", "config": {"shared_axes": null, "alpha_constraint": null, "trainable": true, "alpha_regularizer": null, "alpha_initializer": {"class_name": "Zeros", "config": {}}, "name": "p_re_lu_7"}}, {"inbound_nodes": [[["p_re_lu_7", 0, 0, {}]]], "name": "dropout_7", "class_name": "Dropout", "config": {"name": "dropout_7", "trainable": true, "rate": 0.5}}, {"inbound_nodes": [[["dropout_7", 0, 0, {}]]], "name": "dense_2", "class_name": "Dense", "config": {"kernel_constraint": null, "name": "dense_2", "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "kernel_regularizer": null, "use_bias": true, "units": 64, "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "seed": null, "mode": "fan_in", "distribution": "normal"}}, "activation": "linear", "activity_regularizer": null}}, {"inbound_nodes": [[["dense_2", 0, 0, {}]]], "name": "batch_normalization_8", "class_name": "BatchNormalization", "config": {"momentum": 0.99, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "trainable": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "epsilon": 0.001, "center": true, "axis": -1, "beta_constraint": null, "scale": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "name": "batch_normalization_8", "gamma_regularizer": null, "beta_regularizer": null}}, {"inbound_nodes": [[["batch_normalization_8", 0, 0, {}]]], "name": "p_re_lu_8", "class_name": "PReLU", "config": {"shared_axes": null, "alpha_constraint": null, "trainable": true, "alpha_regularizer": null, "alpha_initializer": {"class_name": "Zeros", "config": {}}, "name": "p_re_lu_8"}}, {"inbound_nodes": [[["p_re_lu_8", 0, 0, {}]]], "name": "dropout_8", "class_name": "Dropout", "config": {"name": "dropout_8", "trainable": true, "rate": 0.5}}, {"inbound_nodes": [[["dropout_8", 0, 0, {}]]], "name": "dense_3", "class_name": "Dense", "config": {"kernel_constraint": null, "name": "dense_3", "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "kernel_regularizer": null, "use_bias": true, "units": 1, "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "activation": "linear", "activity_regularizer": null}}, {"inbound_nodes": [[["dense_3", 0, 0, {}]]], "name": "p_re_lu_9", "class_name": "PReLU", "config": {"shared_axes": null, "alpha_constraint": null, "trainable": true, "alpha_regularizer": null, "alpha_initializer": {"class_name": "Zeros", "config": {}}, "name": "p_re_lu_9"}}]}}