{"backend": "theano", "class_name": "Model", "config": {"name": "model_1", "layers": [{"name": "input_2", "class_name": "InputLayer", "config": {"sparse": false, "batch_input_shape": [null, 9, 20], "dtype": "float32", "name": "input_2"}, "inbound_nodes": []}, {"name": "input_1", "class_name": "InputLayer", "config": {"sparse": false, "batch_input_shape": [null, 48, 20], "dtype": "float32", "name": "input_1"}, "inbound_nodes": []}, {"name": "batch_normalization_8", "class_name": "BatchNormalization", "config": {"moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "beta_constraint": null, "trainable": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99, "gamma_regularizer": null, "center": true, "epsilon": 0.001, "gamma_constraint": null, "scale": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "axis": -1, "name": "batch_normalization_8"}, "inbound_nodes": [[["input_2", 0, 0, {}]]]}, {"name": "batch_normalization_1", "class_name": "BatchNormalization", "config": {"moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "beta_constraint": null, "trainable": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99, "gamma_regularizer": null, "center": true, "epsilon": 0.001, "gamma_constraint": null, "scale": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "axis": -1, "name": "batch_normalization_1"}, "inbound_nodes": [[["input_1", 0, 0, {}]]]}, {"name": "p_re_lu_8", "class_name": "PReLU", "config": {"alpha_initializer": {"class_name": "Zeros", "config": {}}, "name": "p_re_lu_8", "shared_axes": null, "alpha_constraint": null, "trainable": true, "alpha_regularizer": null}, "inbound_nodes": [[["batch_normalization_8", 0, 0, {}]]]}, {"name": "p_re_lu_1", "class_name": "PReLU", "config": {"alpha_initializer": {"class_name": "Zeros", "config": {}}, "name": "p_re_lu_1", "shared_axes": null, "alpha_constraint": null, "trainable": true, "alpha_regularizer": null}, "inbound_nodes": [[["batch_normalization_1", 0, 0, {}]]]}, {"name": "conv1d_10", "class_name": "Conv1D", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_in", "scale": 2.0, "seed": null, "distribution": "normal"}}, "bias_constraint": null, "padding": "valid", "trainable": true, "kernel_regularizer": null, "bias_regularizer": null, "activation": "linear", "filters": 64, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "conv1d_10", "dilation_rate": [1], "strides": [1], "kernel_size": [1], "kernel_constraint": null, "activity_regularizer": null, "use_bias": true}, "inbound_nodes": [[["p_re_lu_8", 0, 0, {}]]]}, {"name": "conv1d_1", "class_name": "Conv1D", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_in", "scale": 2.0, "seed": null, "distribution": "normal"}}, "bias_constraint": null, "padding": "valid", "trainable": true, "kernel_regularizer": null, "bias_regularizer": null, "activation": "linear", "filters": 64, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "conv1d_1", "dilation_rate": [1], "strides": [1], "kernel_size": [1], "kernel_constraint": null, "activity_regularizer": null, "use_bias": true}, "inbound_nodes": [[["p_re_lu_1", 0, 0, {}]]]}, {"name": "batch_normalization_9", "class_name": "BatchNormalization", "config": {"moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "beta_constraint": null, "trainable": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99, "gamma_regularizer": null, "center": true, "epsilon": 0.001, "gamma_constraint": null, "scale": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "axis": -1, "name": "batch_normalization_9"}, "inbound_nodes": [[["conv1d_10", 0, 0, {}]]]}, {"name": "batch_normalization_2", "class_name": "BatchNormalization", "config": {"moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "beta_constraint": null, "trainable": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99, "gamma_regularizer": null, "center": true, "epsilon": 0.001, "gamma_constraint": null, "scale": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "axis": -1, "name": "batch_normalization_2"}, "inbound_nodes": [[["conv1d_1", 0, 0, {}]]]}, {"name": "p_re_lu_9", "class_name": "PReLU", "config": {"alpha_initializer": {"class_name": "Zeros", "config": {}}, "name": "p_re_lu_9", "shared_axes": null, "alpha_constraint": null, "trainable": true, "alpha_regularizer": null}, "inbound_nodes": [[["batch_normalization_9", 0, 0, {}]]]}, {"name": "p_re_lu_2", "class_name": "PReLU", "config": {"alpha_initializer": {"class_name": "Zeros", "config": {}}, "name": "p_re_lu_2", "shared_axes": null, "alpha_constraint": null, "trainable": true, "alpha_regularizer": null}, "inbound_nodes": [[["batch_normalization_2", 0, 0, {}]]]}, {"name": "dropout_4", "class_name": "Dropout", "config": {"rate": 0.3, "trainable": true, "name": "dropout_4"}, "inbound_nodes": [[["p_re_lu_9", 0, 0, {}]]]}, {"name": "dropout_1", "class_name": "Dropout", "config": {"rate": 0.3, "trainable": true, "name": "dropout_1"}, "inbound_nodes": [[["p_re_lu_2", 0, 0, {}]]]}, {"name": "conv1d_12", "class_name": "Conv1D", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_in", "scale": 2.0, "seed": null, "distribution": "normal"}}, "bias_constraint": null, "padding": "valid", "trainable": true, "kernel_regularizer": null, "bias_regularizer": null, "activation": "linear", "filters": 128, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "conv1d_12", "dilation_rate": [1], "strides": [1], "kernel_size": [1], "kernel_constraint": null, "activity_regularizer": null, "use_bias": true}, "inbound_nodes": [[["p_re_lu_8", 0, 0, {}]]]}, {"name": "conv1d_11", "class_name": "Conv1D", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_in", "scale": 2.0, "seed": null, "distribution": "normal"}}, "bias_constraint": null, "padding": "valid", "trainable": true, "kernel_regularizer": null, "bias_regularizer": null, "activation": "linear", "filters": 128, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "conv1d_11", "dilation_rate": [1], "strides": [1], "kernel_size": [1], "kernel_constraint": null, "activity_regularizer": null, "use_bias": true}, "inbound_nodes": [[["dropout_4", 0, 0, {}]]]}, {"name": "conv1d_3", "class_name": "Conv1D", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_in", "scale": 2.0, "seed": null, "distribution": "normal"}}, "bias_constraint": null, "padding": "valid", "trainable": true, "kernel_regularizer": null, "bias_regularizer": null, "activation": "linear", "filters": 128, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "conv1d_3", "dilation_rate": [1], "strides": [1], "kernel_size": [1], "kernel_constraint": null, "activity_regularizer": null, "use_bias": true}, "inbound_nodes": [[["p_re_lu_1", 0, 0, {}]]]}, {"name": "conv1d_2", "class_name": "Conv1D", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_in", "scale": 2.0, "seed": null, "distribution": "normal"}}, "bias_constraint": null, "padding": "valid", "trainable": true, "kernel_regularizer": null, "bias_regularizer": null, "activation": "linear", "filters": 128, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "conv1d_2", "dilation_rate": [1], "strides": [1], "kernel_size": [1], "kernel_constraint": null, "activity_regularizer": null, "use_bias": true}, "inbound_nodes": [[["dropout_1", 0, 0, {}]]]}, {"name": "add_4", "class_name": "Add", "config": {"name": "add_4", "trainable": true}, "inbound_nodes": [[["conv1d_12", 0, 0, {}], ["conv1d_11", 0, 0, {}]]]}, {"name": "add_1", "class_name": "Add", "config": {"name": "add_1", "trainable": true}, "inbound_nodes": [[["conv1d_3", 0, 0, {}], ["conv1d_2", 0, 0, {}]]]}, {"name": "batch_normalization_10", "class_name": "BatchNormalization", "config": {"moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "beta_constraint": null, "trainable": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99, "gamma_regularizer": null, "center": true, "epsilon": 0.001, "gamma_constraint": null, "scale": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "axis": -1, "name": "batch_normalization_10"}, "inbound_nodes": [[["add_4", 0, 0, {}]]]}, {"name": "batch_normalization_3", "class_name": "BatchNormalization", "config": {"moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "beta_constraint": null, "trainable": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99, "gamma_regularizer": null, "center": true, "epsilon": 0.001, "gamma_constraint": null, "scale": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "axis": -1, "name": "batch_normalization_3"}, "inbound_nodes": [[["add_1", 0, 0, {}]]]}, {"name": "p_re_lu_10", "class_name": "PReLU", "config": {"alpha_initializer": {"class_name": "Zeros", "config": {}}, "name": "p_re_lu_10", "shared_axes": null, "alpha_constraint": null, "trainable": true, "alpha_regularizer": null}, "inbound_nodes": [[["batch_normalization_10", 0, 0, {}]]]}, {"name": "p_re_lu_3", "class_name": "PReLU", "config": {"alpha_initializer": {"class_name": "Zeros", "config": {}}, "name": "p_re_lu_3", "shared_axes": null, "alpha_constraint": null, "trainable": true, "alpha_regularizer": null}, "inbound_nodes": [[["batch_normalization_3", 0, 0, {}]]]}, {"name": "conv1d_13", "class_name": "Conv1D", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_in", "scale": 2.0, "seed": null, "distribution": "normal"}}, "bias_constraint": null, "padding": "valid", "trainable": true, "kernel_regularizer": null, "bias_regularizer": null, "activation": "linear", "filters": 128, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "conv1d_13", "dilation_rate": [1], "strides": [1], "kernel_size": [1], "kernel_constraint": null, "activity_regularizer": null, "use_bias": true}, "inbound_nodes": [[["p_re_lu_10", 0, 0, {}]]]}, {"name": "conv1d_4", "class_name": "Conv1D", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_in", "scale": 2.0, "seed": null, "distribution": "normal"}}, "bias_constraint": null, "padding": "valid", "trainable": true, "kernel_regularizer": null, "bias_regularizer": null, "activation": "linear", "filters": 128, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "conv1d_4", "dilation_rate": [1], "strides": [1], "kernel_size": [1], "kernel_constraint": null, "activity_regularizer": null, "use_bias": true}, "inbound_nodes": [[["p_re_lu_3", 0, 0, {}]]]}, {"name": "batch_normalization_11", "class_name": "BatchNormalization", "config": {"moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "beta_constraint": null, "trainable": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99, "gamma_regularizer": null, "center": true, "epsilon": 0.001, "gamma_constraint": null, "scale": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "axis": -1, "name": "batch_normalization_11"}, "inbound_nodes": [[["conv1d_13", 0, 0, {}]]]}, {"name": "batch_normalization_4", "class_name": "BatchNormalization", "config": {"moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "beta_constraint": null, "trainable": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99, "gamma_regularizer": null, "center": true, "epsilon": 0.001, "gamma_constraint": null, "scale": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "axis": -1, "name": "batch_normalization_4"}, "inbound_nodes": [[["conv1d_4", 0, 0, {}]]]}, {"name": "p_re_lu_11", "class_name": "PReLU", "config": {"alpha_initializer": {"class_name": "Zeros", "config": {}}, "name": "p_re_lu_11", "shared_axes": null, "alpha_constraint": null, "trainable": true, "alpha_regularizer": null}, "inbound_nodes": [[["batch_normalization_11", 0, 0, {}]]]}, {"name": "p_re_lu_4", "class_name": "PReLU", "config": {"alpha_initializer": {"class_name": "Zeros", "config": {}}, "name": "p_re_lu_4", "shared_axes": null, "alpha_constraint": null, "trainable": true, "alpha_regularizer": null}, "inbound_nodes": [[["batch_normalization_4", 0, 0, {}]]]}, {"name": "dropout_5", "class_name": "Dropout", "config": {"rate": 0.3, "trainable": true, "name": "dropout_5"}, "inbound_nodes": [[["p_re_lu_11", 0, 0, {}]]]}, {"name": "dropout_2", "class_name": "Dropout", "config": {"rate": 0.3, "trainable": true, "name": "dropout_2"}, "inbound_nodes": [[["p_re_lu_4", 0, 0, {}]]]}, {"name": "conv1d_15", "class_name": "Conv1D", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_in", "scale": 2.0, "seed": null, "distribution": "normal"}}, "bias_constraint": null, "padding": "valid", "trainable": true, "kernel_regularizer": null, "bias_regularizer": null, "activation": "linear", "filters": 196, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "conv1d_15", "dilation_rate": [1], "strides": [1], "kernel_size": [1], "kernel_constraint": null, "activity_regularizer": null, "use_bias": true}, "inbound_nodes": [[["p_re_lu_10", 0, 0, {}]]]}, {"name": "conv1d_14", "class_name": "Conv1D", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_in", "scale": 2.0, "seed": null, "distribution": "normal"}}, "bias_constraint": null, "padding": "valid", "trainable": true, "kernel_regularizer": null, "bias_regularizer": null, "activation": "linear", "filters": 196, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "conv1d_14", "dilation_rate": [1], "strides": [1], "kernel_size": [1], "kernel_constraint": null, "activity_regularizer": null, "use_bias": true}, "inbound_nodes": [[["dropout_5", 0, 0, {}]]]}, {"name": "conv1d_6", "class_name": "Conv1D", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_in", "scale": 2.0, "seed": null, "distribution": "normal"}}, "bias_constraint": null, "padding": "valid", "trainable": true, "kernel_regularizer": null, "bias_regularizer": null, "activation": "linear", "filters": 196, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "conv1d_6", "dilation_rate": [1], "strides": [1], "kernel_size": [1], "kernel_constraint": null, "activity_regularizer": null, "use_bias": true}, "inbound_nodes": [[["p_re_lu_3", 0, 0, {}]]]}, {"name": "conv1d_5", "class_name": "Conv1D", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_in", "scale": 2.0, "seed": null, "distribution": "normal"}}, "bias_constraint": null, "padding": "valid", "trainable": true, "kernel_regularizer": null, "bias_regularizer": null, "activation": "linear", "filters": 196, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "conv1d_5", "dilation_rate": [1], "strides": [1], "kernel_size": [1], "kernel_constraint": null, "activity_regularizer": null, "use_bias": true}, "inbound_nodes": [[["dropout_2", 0, 0, {}]]]}, {"name": "add_5", "class_name": "Add", "config": {"name": "add_5", "trainable": true}, "inbound_nodes": [[["conv1d_15", 0, 0, {}], ["conv1d_14", 0, 0, {}]]]}, {"name": "add_2", "class_name": "Add", "config": {"name": "add_2", "trainable": true}, "inbound_nodes": [[["conv1d_6", 0, 0, {}], ["conv1d_5", 0, 0, {}]]]}, {"name": "batch_normalization_12", "class_name": "BatchNormalization", "config": {"moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "beta_constraint": null, "trainable": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99, "gamma_regularizer": null, "center": true, "epsilon": 0.001, "gamma_constraint": null, "scale": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "axis": -1, "name": "batch_normalization_12"}, "inbound_nodes": [[["add_5", 0, 0, {}]]]}, {"name": "batch_normalization_5", "class_name": "BatchNormalization", "config": {"moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "beta_constraint": null, "trainable": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99, "gamma_regularizer": null, "center": true, "epsilon": 0.001, "gamma_constraint": null, "scale": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "axis": -1, "name": "batch_normalization_5"}, "inbound_nodes": [[["add_2", 0, 0, {}]]]}, {"name": "p_re_lu_12", "class_name": "PReLU", "config": {"alpha_initializer": {"class_name": "Zeros", "config": {}}, "name": "p_re_lu_12", "shared_axes": null, "alpha_constraint": null, "trainable": true, "alpha_regularizer": null}, "inbound_nodes": [[["batch_normalization_12", 0, 0, {}]]]}, {"name": "p_re_lu_5", "class_name": "PReLU", "config": {"alpha_initializer": {"class_name": "Zeros", "config": {}}, "name": "p_re_lu_5", "shared_axes": null, "alpha_constraint": null, "trainable": true, "alpha_regularizer": null}, "inbound_nodes": [[["batch_normalization_5", 0, 0, {}]]]}, {"name": "conv1d_16", "class_name": "Conv1D", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_in", "scale": 2.0, "seed": null, "distribution": "normal"}}, "bias_constraint": null, "padding": "valid", "trainable": true, "kernel_regularizer": null, "bias_regularizer": null, "activation": "linear", "filters": 196, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "conv1d_16", "dilation_rate": [1], "strides": [1], "kernel_size": [1], "kernel_constraint": null, "activity_regularizer": null, "use_bias": true}, "inbound_nodes": [[["p_re_lu_12", 0, 0, {}]]]}, {"name": "conv1d_7", "class_name": "Conv1D", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_in", "scale": 2.0, "seed": null, "distribution": "normal"}}, "bias_constraint": null, "padding": "valid", "trainable": true, "kernel_regularizer": null, "bias_regularizer": null, "activation": "linear", "filters": 196, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "conv1d_7", "dilation_rate": [1], "strides": [1], "kernel_size": [1], "kernel_constraint": null, "activity_regularizer": null, "use_bias": true}, "inbound_nodes": [[["p_re_lu_5", 0, 0, {}]]]}, {"name": "batch_normalization_13", "class_name": "BatchNormalization", "config": {"moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "beta_constraint": null, "trainable": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99, "gamma_regularizer": null, "center": true, "epsilon": 0.001, "gamma_constraint": null, "scale": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "axis": -1, "name": "batch_normalization_13"}, "inbound_nodes": [[["conv1d_16", 0, 0, {}]]]}, {"name": "batch_normalization_6", "class_name": "BatchNormalization", "config": {"moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "beta_constraint": null, "trainable": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99, "gamma_regularizer": null, "center": true, "epsilon": 0.001, "gamma_constraint": null, "scale": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "axis": -1, "name": "batch_normalization_6"}, "inbound_nodes": [[["conv1d_7", 0, 0, {}]]]}, {"name": "p_re_lu_13", "class_name": "PReLU", "config": {"alpha_initializer": {"class_name": "Zeros", "config": {}}, "name": "p_re_lu_13", "shared_axes": null, "alpha_constraint": null, "trainable": true, "alpha_regularizer": null}, "inbound_nodes": [[["batch_normalization_13", 0, 0, {}]]]}, {"name": "p_re_lu_6", "class_name": "PReLU", "config": {"alpha_initializer": {"class_name": "Zeros", "config": {}}, "name": "p_re_lu_6", "shared_axes": null, "alpha_constraint": null, "trainable": true, "alpha_regularizer": null}, "inbound_nodes": [[["batch_normalization_6", 0, 0, {}]]]}, {"name": "dropout_6", "class_name": "Dropout", "config": {"rate": 0.3, "trainable": true, "name": "dropout_6"}, "inbound_nodes": [[["p_re_lu_13", 0, 0, {}]]]}, {"name": "dropout_3", "class_name": "Dropout", "config": {"rate": 0.3, "trainable": true, "name": "dropout_3"}, "inbound_nodes": [[["p_re_lu_6", 0, 0, {}]]]}, {"name": "conv1d_18", "class_name": "Conv1D", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_in", "scale": 2.0, "seed": null, "distribution": "normal"}}, "bias_constraint": null, "padding": "valid", "trainable": true, "kernel_regularizer": null, "bias_regularizer": null, "activation": "linear", "filters": 256, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "conv1d_18", "dilation_rate": [1], "strides": [1], "kernel_size": [1], "kernel_constraint": null, "activity_regularizer": null, "use_bias": true}, "inbound_nodes": [[["p_re_lu_12", 0, 0, {}]]]}, {"name": "conv1d_17", "class_name": "Conv1D", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_in", "scale": 2.0, "seed": null, "distribution": "normal"}}, "bias_constraint": null, "padding": "valid", "trainable": true, "kernel_regularizer": null, "bias_regularizer": null, "activation": "linear", "filters": 256, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "conv1d_17", "dilation_rate": [1], "strides": [1], "kernel_size": [1], "kernel_constraint": null, "activity_regularizer": null, "use_bias": true}, "inbound_nodes": [[["dropout_6", 0, 0, {}]]]}, {"name": "conv1d_9", "class_name": "Conv1D", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_in", "scale": 2.0, "seed": null, "distribution": "normal"}}, "bias_constraint": null, "padding": "valid", "trainable": true, "kernel_regularizer": null, "bias_regularizer": null, "activation": "linear", "filters": 256, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "conv1d_9", "dilation_rate": [1], "strides": [1], "kernel_size": [1], "kernel_constraint": null, "activity_regularizer": null, "use_bias": true}, "inbound_nodes": [[["p_re_lu_5", 0, 0, {}]]]}, {"name": "conv1d_8", "class_name": "Conv1D", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_in", "scale": 2.0, "seed": null, "distribution": "normal"}}, "bias_constraint": null, "padding": "valid", "trainable": true, "kernel_regularizer": null, "bias_regularizer": null, "activation": "linear", "filters": 256, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "conv1d_8", "dilation_rate": [1], "strides": [1], "kernel_size": [1], "kernel_constraint": null, "activity_regularizer": null, "use_bias": true}, "inbound_nodes": [[["dropout_3", 0, 0, {}]]]}, {"name": "add_6", "class_name": "Add", "config": {"name": "add_6", "trainable": true}, "inbound_nodes": [[["conv1d_18", 0, 0, {}], ["conv1d_17", 0, 0, {}]]]}, {"name": "add_3", "class_name": "Add", "config": {"name": "add_3", "trainable": true}, "inbound_nodes": [[["conv1d_9", 0, 0, {}], ["conv1d_8", 0, 0, {}]]]}, {"name": "batch_normalization_14", "class_name": "BatchNormalization", "config": {"moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "beta_constraint": null, "trainable": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99, "gamma_regularizer": null, "center": true, "epsilon": 0.001, "gamma_constraint": null, "scale": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "axis": -1, "name": "batch_normalization_14"}, "inbound_nodes": [[["add_6", 0, 0, {}]]]}, {"name": "batch_normalization_7", "class_name": "BatchNormalization", "config": {"moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "beta_constraint": null, "trainable": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99, "gamma_regularizer": null, "center": true, "epsilon": 0.001, "gamma_constraint": null, "scale": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "axis": -1, "name": "batch_normalization_7"}, "inbound_nodes": [[["add_3", 0, 0, {}]]]}, {"name": "p_re_lu_14", "class_name": "PReLU", "config": {"alpha_initializer": {"class_name": "Zeros", "config": {}}, "name": "p_re_lu_14", "shared_axes": null, "alpha_constraint": null, "trainable": true, "alpha_regularizer": null}, "inbound_nodes": [[["batch_normalization_14", 0, 0, {}]]]}, {"name": "p_re_lu_7", "class_name": "PReLU", "config": {"alpha_initializer": {"class_name": "Zeros", "config": {}}, "name": "p_re_lu_7", "shared_axes": null, "alpha_constraint": null, "trainable": true, "alpha_regularizer": null}, "inbound_nodes": [[["batch_normalization_7", 0, 0, {}]]]}, {"name": "flatten_2", "class_name": "Flatten", "config": {"name": "flatten_2", "trainable": true}, "inbound_nodes": [[["p_re_lu_14", 0, 0, {}]]]}, {"name": "flatten_1", "class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true}, "inbound_nodes": [[["p_re_lu_7", 0, 0, {}]]]}, {"name": "concatenate_1", "class_name": "Concatenate", "config": {"trainable": true, "axis": -1, "name": "concatenate_1"}, "inbound_nodes": [[["flatten_2", 0, 0, {}], ["flatten_1", 0, 0, {}]]]}, {"name": "dense_1", "class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_in", "scale": 2.0, "seed": null, "distribution": "normal"}}, "bias_constraint": null, "use_bias": true, "trainable": true, "kernel_regularizer": null, "bias_regularizer": null, "units": 64, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "linear", "kernel_constraint": null, "activity_regularizer": null, "name": "dense_1"}, "inbound_nodes": [[["concatenate_1", 0, 0, {}]]]}, {"name": "batch_normalization_15", "class_name": "BatchNormalization", "config": {"moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "beta_constraint": null, "trainable": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99, "gamma_regularizer": null, "center": true, "epsilon": 0.001, "gamma_constraint": null, "scale": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "axis": -1, "name": "batch_normalization_15"}, "inbound_nodes": [[["dense_1", 0, 0, {}]]]}, {"name": "p_re_lu_15", "class_name": "PReLU", "config": {"alpha_initializer": {"class_name": "Zeros", "config": {}}, "name": "p_re_lu_15", "shared_axes": null, "alpha_constraint": null, "trainable": true, "alpha_regularizer": null}, "inbound_nodes": [[["batch_normalization_15", 0, 0, {}]]]}, {"name": "dropout_7", "class_name": "Dropout", "config": {"rate": 0.5, "trainable": true, "name": "dropout_7"}, "inbound_nodes": [[["p_re_lu_15", 0, 0, {}]]]}, {"name": "dense_2", "class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_in", "scale": 2.0, "seed": null, "distribution": "normal"}}, "bias_constraint": null, "use_bias": true, "trainable": true, "kernel_regularizer": null, "bias_regularizer": null, "units": 64, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "linear", "kernel_constraint": null, "activity_regularizer": null, "name": "dense_2"}, "inbound_nodes": [[["dropout_7", 0, 0, {}]]]}, {"name": "batch_normalization_16", "class_name": "BatchNormalization", "config": {"moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "beta_constraint": null, "trainable": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99, "gamma_regularizer": null, "center": true, "epsilon": 0.001, "gamma_constraint": null, "scale": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "axis": -1, "name": "batch_normalization_16"}, "inbound_nodes": [[["dense_2", 0, 0, {}]]]}, {"name": "p_re_lu_16", "class_name": "PReLU", "config": {"alpha_initializer": {"class_name": "Zeros", "config": {}}, "name": "p_re_lu_16", "shared_axes": null, "alpha_constraint": null, "trainable": true, "alpha_regularizer": null}, "inbound_nodes": [[["batch_normalization_16", 0, 0, {}]]]}, {"name": "dropout_8", "class_name": "Dropout", "config": {"rate": 0.5, "trainable": true, "name": "dropout_8"}, "inbound_nodes": [[["p_re_lu_16", 0, 0, {}]]]}, {"name": "dense_3", "class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}}, "bias_constraint": null, "use_bias": true, "trainable": true, "kernel_regularizer": null, "bias_regularizer": null, "units": 1, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "linear", "kernel_constraint": null, "activity_regularizer": null, "name": "dense_3"}, "inbound_nodes": [[["dropout_8", 0, 0, {}]]]}, {"name": "pred_reg", "class_name": "PReLU", "config": {"alpha_initializer": {"class_name": "Zeros", "config": {}}, "name": "pred_reg", "shared_axes": null, "alpha_constraint": null, "trainable": true, "alpha_regularizer": null}, "inbound_nodes": [[["dense_3", 0, 0, {}]]]}], "input_layers": [["input_1", 0, 0], ["input_2", 0, 0]], "output_layers": [["pred_reg", 0, 0]]}, "keras_version": "2.0.3"}