{"class_name": "Model", "backend": "theano", "config": {"layers": [{"class_name": "InputLayer", "inbound_nodes": [], "name": "input_2", "config": {"dtype": "float32", "sparse": false, "name": "input_2", "batch_input_shape": [null, 9, 20]}}, {"class_name": "InputLayer", "inbound_nodes": [], "name": "input_1", "config": {"dtype": "float32", "sparse": false, "name": "input_1", "batch_input_shape": [null, 34, 20]}}, {"class_name": "Flatten", "inbound_nodes": [[["input_2", 0, 0, {}]]], "name": "flatten_2", "config": {"name": "flatten_2", "trainable": true}}, {"class_name": "Flatten", "inbound_nodes": [[["input_1", 0, 0, {}]]], "name": "flatten_1", "config": {"name": "flatten_1", "trainable": true}}, {"class_name": "Dense", "inbound_nodes": [[["flatten_2", 0, 0, {}]]], "name": "dense_2", "config": {"bias_regularizer": null, "activity_regularizer": null, "kernel_regularizer": null, "units": 64, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "seed": null, "distribution": "normal"}}, "trainable": true, "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "dense_2", "bias_constraint": null, "kernel_constraint": null, "activation": "linear"}}, {"class_name": "Dense", "inbound_nodes": [[["flatten_1", 0, 0, {}]]], "name": "dense_1", "config": {"bias_regularizer": null, "activity_regularizer": null, "kernel_regularizer": null, "units": 64, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "seed": null, "distribution": "normal"}}, "trainable": true, "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "dense_1", "bias_constraint": null, "kernel_constraint": null, "activation": "linear"}}, {"class_name": "BatchNormalization", "inbound_nodes": [[["dense_2", 0, 0, {}]]], "name": "batch_normalization_2", "config": {"beta_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "momentum": 0.99, "gamma_regularizer": null, "trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "axis": -1, "name": "batch_normalization_2", "scale": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "epsilon": 0.001, "center": true}}, {"class_name": "BatchNormalization", "inbound_nodes": [[["dense_1", 0, 0, {}]]], "name": "batch_normalization_1", "config": {"beta_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "momentum": 0.99, "gamma_regularizer": null, "trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "axis": -1, "name": "batch_normalization_1", "scale": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "epsilon": 0.001, "center": true}}, {"class_name": "PReLU", "inbound_nodes": [[["batch_normalization_2", 0, 0, {}]]], "name": "p_re_lu_2", "config": {"name": "p_re_lu_2", "alpha_initializer": {"class_name": "Zeros", "config": {}}, "alpha_regularizer": null, "shared_axes": null, "trainable": true, "alpha_constraint": null}}, {"class_name": "PReLU", "inbound_nodes": [[["batch_normalization_1", 0, 0, {}]]], "name": "p_re_lu_1", "config": {"name": "p_re_lu_1", "alpha_initializer": {"class_name": "Zeros", "config": {}}, "alpha_regularizer": null, "shared_axes": null, "trainable": true, "alpha_constraint": null}}, {"class_name": "Dropout", "inbound_nodes": [[["p_re_lu_2", 0, 0, {}]]], "name": "dropout_2", "config": {"rate": 0.3, "name": "dropout_2", "trainable": true}}, {"class_name": "Dropout", "inbound_nodes": [[["p_re_lu_1", 0, 0, {}]]], "name": "dropout_1", "config": {"rate": 0.3, "name": "dropout_1", "trainable": true}}, {"class_name": "Concatenate", "inbound_nodes": [[["dropout_2", 0, 0, {}], ["dropout_1", 0, 0, {}]]], "name": "concatenate_1", "config": {"axis": -1, "name": "concatenate_1", "trainable": true}}, {"class_name": "Dense", "inbound_nodes": [[["concatenate_1", 0, 0, {}]]], "name": "dense_3", "config": {"bias_regularizer": null, "activity_regularizer": null, "kernel_regularizer": null, "units": 128, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "seed": null, "distribution": "normal"}}, "trainable": true, "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "dense_3", "bias_constraint": null, "kernel_constraint": null, "activation": "linear"}}, {"class_name": "BatchNormalization", "inbound_nodes": [[["dense_3", 0, 0, {}]]], "name": "batch_normalization_3", "config": {"beta_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "momentum": 0.99, "gamma_regularizer": null, "trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "axis": -1, "name": "batch_normalization_3", "scale": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "epsilon": 0.001, "center": true}}, {"class_name": "PReLU", "inbound_nodes": [[["batch_normalization_3", 0, 0, {}]]], "name": "p_re_lu_3", "config": {"name": "p_re_lu_3", "alpha_initializer": {"class_name": "Zeros", "config": {}}, "alpha_regularizer": null, "shared_axes": null, "trainable": true, "alpha_constraint": null}}, {"class_name": "Dropout", "inbound_nodes": [[["p_re_lu_3", 0, 0, {}]]], "name": "dropout_3", "config": {"rate": 0.3, "name": "dropout_3", "trainable": true}}, {"class_name": "Dense", "inbound_nodes": [[["dropout_3", 0, 0, {}]]], "name": "dense_4", "config": {"bias_regularizer": null, "activity_regularizer": null, "kernel_regularizer": null, "units": 1, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "trainable": true, "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "dense_4", "bias_constraint": null, "kernel_constraint": null, "activation": "linear"}}, {"class_name": "PReLU", "inbound_nodes": [[["dense_4", 0, 0, {}]]], "name": "p_re_lu_4", "config": {"name": "p_re_lu_4", "alpha_initializer": {"class_name": "Zeros", "config": {}}, "alpha_regularizer": null, "shared_axes": null, "trainable": true, "alpha_constraint": null}}], "input_layers": [["input_1", 0, 0], ["input_2", 0, 0]], "name": "model_1", "output_layers": [["p_re_lu_4", 0, 0]]}, "keras_version": "2.0.3"}