{"class_name": "Model", "config": {"output_layers": [["p_re_lu_5", 0, 0]], "input_layers": [["input_1", 0, 0], ["input_2", 0, 0]], "name": "model_1", "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 9, 20], "name": "input_2", "dtype": "float32", "sparse": false}, "inbound_nodes": [], "name": "input_2"}, {"class_name": "InputLayer", "config": {"batch_input_shape": [null, 34, 20], "name": "input_1", "dtype": "float32", "sparse": false}, "inbound_nodes": [], "name": "input_1"}, {"class_name": "GRU", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "normal", "seed": null}}, "implementation": 2, "unroll": true, "recurrent_constraint": null, "activation": "tanh", "bias_regularizer": null, "name": "gru_2", "recurrent_regularizer": null, "return_sequences": false, "recurrent_activation": "hard_sigmoid", "kernel_constraint": null, "dropout": 0.2, "trainable": true, "recurrent_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "normal", "seed": null}}, "go_backwards": false, "activity_regularizer": null, "use_bias": true, "recurrent_dropout": 0.2, "units": 64, "bias_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "normal", "seed": null}}, "bias_constraint": null, "kernel_regularizer": null, "stateful": false}, "inbound_nodes": [[["input_2", 0, 0, {}]]], "name": "gru_2"}, {"class_name": "GRU", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "normal", "seed": null}}, "implementation": 2, "unroll": true, "recurrent_constraint": null, "activation": "tanh", "bias_regularizer": null, "name": "gru_1", "recurrent_regularizer": null, "return_sequences": false, "recurrent_activation": "hard_sigmoid", "kernel_constraint": null, "dropout": 0.2, "trainable": true, "recurrent_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "normal", "seed": null}}, "go_backwards": false, "activity_regularizer": null, "use_bias": true, "recurrent_dropout": 0.2, "units": 64, "bias_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "normal", "seed": null}}, "bias_constraint": null, "kernel_regularizer": null, "stateful": false}, "inbound_nodes": [[["input_1", 0, 0, {}]]], "name": "gru_1"}, {"class_name": "BatchNormalization", "config": {"moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "trainable": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "axis": -1, "gamma_initializer": {"class_name": "Ones", "config": {}}, "scale": true, "center": true, "epsilon": 0.001, "gamma_regularizer": null, "beta_constraint": null, "beta_regularizer": null, "name": "batch_normalization_2", "momentum": 0.99}, "inbound_nodes": [[["gru_2", 0, 0, {}]]], "name": "batch_normalization_2"}, {"class_name": "BatchNormalization", "config": {"moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "trainable": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "axis": -1, "gamma_initializer": {"class_name": "Ones", "config": {}}, "scale": true, "center": true, "epsilon": 0.001, "gamma_regularizer": null, "beta_constraint": null, "beta_regularizer": null, "name": "batch_normalization_1", "momentum": 0.99}, "inbound_nodes": [[["gru_1", 0, 0, {}]]], "name": "batch_normalization_1"}, {"class_name": "PReLU", "config": {"trainable": true, "shared_axes": null, "alpha_initializer": {"class_name": "Zeros", "config": {}}, "alpha_regularizer": null, "alpha_constraint": null, "name": "p_re_lu_2"}, "inbound_nodes": [[["batch_normalization_2", 0, 0, {}]]], "name": "p_re_lu_2"}, {"class_name": "PReLU", "config": {"trainable": true, "shared_axes": null, "alpha_initializer": {"class_name": "Zeros", "config": {}}, "alpha_regularizer": null, "alpha_constraint": null, "name": "p_re_lu_1"}, "inbound_nodes": [[["batch_normalization_1", 0, 0, {}]]], "name": "p_re_lu_1"}, {"class_name": "Concatenate", "config": {"trainable": true, "axis": -1, "name": "concatenate_1"}, "inbound_nodes": [[["p_re_lu_2", 0, 0, {}], ["p_re_lu_1", 0, 0, {}]]], "name": "concatenate_1"}, {"class_name": "Dense", "config": {"kernel_constraint": null, "activation": "linear", "trainable": true, "activity_regularizer": null, "use_bias": true, "units": 64, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "kernel_regularizer": null, "name": "dense_1", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "uniform", "seed": null}}}, "inbound_nodes": [[["concatenate_1", 0, 0, {}]]], "name": "dense_1"}, {"class_name": "BatchNormalization", "config": {"moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "trainable": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "axis": -1, "gamma_initializer": {"class_name": "Ones", "config": {}}, "scale": true, "center": true, "epsilon": 0.001, "gamma_regularizer": null, "beta_constraint": null, "beta_regularizer": null, "name": "batch_normalization_3", "momentum": 0.99}, "inbound_nodes": [[["dense_1", 0, 0, {}]]], "name": "batch_normalization_3"}, {"class_name": "PReLU", "config": {"trainable": true, "shared_axes": null, "alpha_initializer": {"class_name": "Zeros", "config": {}}, "alpha_regularizer": null, "alpha_constraint": null, "name": "p_re_lu_3"}, "inbound_nodes": [[["batch_normalization_3", 0, 0, {}]]], "name": "p_re_lu_3"}, {"class_name": "Dropout", "config": {"trainable": true, "name": "dropout_1", "rate": 0.3}, "inbound_nodes": [[["p_re_lu_3", 0, 0, {}]]], "name": "dropout_1"}, {"class_name": "Dense", "config": {"kernel_constraint": null, "activation": "linear", "trainable": true, "activity_regularizer": null, "use_bias": true, "units": 64, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "kernel_regularizer": null, "name": "dense_2", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "uniform", "seed": null}}}, "inbound_nodes": [[["dropout_1", 0, 0, {}]]], "name": "dense_2"}, {"class_name": "BatchNormalization", "config": {"moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "trainable": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "axis": -1, "gamma_initializer": {"class_name": "Ones", "config": {}}, "scale": true, "center": true, "epsilon": 0.001, "gamma_regularizer": null, "beta_constraint": null, "beta_regularizer": null, "name": "batch_normalization_4", "momentum": 0.99}, "inbound_nodes": [[["dense_2", 0, 0, {}]]], "name": "batch_normalization_4"}, {"class_name": "PReLU", "config": {"trainable": true, "shared_axes": null, "alpha_initializer": {"class_name": "Zeros", "config": {}}, "alpha_regularizer": null, "alpha_constraint": null, "name": "p_re_lu_4"}, "inbound_nodes": [[["batch_normalization_4", 0, 0, {}]]], "name": "p_re_lu_4"}, {"class_name": "Dropout", "config": {"trainable": true, "name": "dropout_2", "rate": 0.3}, "inbound_nodes": [[["p_re_lu_4", 0, 0, {}]]], "name": "dropout_2"}, {"class_name": "Dense", "config": {"kernel_constraint": null, "activation": "linear", "trainable": true, "activity_regularizer": null, "use_bias": true, "units": 1, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "kernel_regularizer": null, "name": "dense_3", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}}, "inbound_nodes": [[["dropout_2", 0, 0, {}]]], "name": "dense_3"}, {"class_name": "PReLU", "config": {"trainable": true, "shared_axes": null, "alpha_initializer": {"class_name": "Zeros", "config": {}}, "alpha_regularizer": null, "alpha_constraint": null, "name": "p_re_lu_5"}, "inbound_nodes": [[["dense_3", 0, 0, {}]]], "name": "p_re_lu_5"}]}, "keras_version": "2.0.3", "backend": "theano"}