{"config": {"layers": [{"config": {"dtype": "float32", "sparse": false, "name": "input_2", "batch_input_shape": [null, 9, 20]}, "name": "input_2", "class_name": "InputLayer", "inbound_nodes": []}, {"config": {"dtype": "float32", "sparse": false, "name": "input_1", "batch_input_shape": [null, 34, 20]}, "name": "input_1", "class_name": "InputLayer", "inbound_nodes": []}, {"config": {"gamma_constraint": null, "trainable": true, "name": "batch_normalization_4", "beta_regularizer": null, "gamma_regularizer": null, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "epsilon": 0.001, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "beta_constraint": null, "axis": -1, "center": true, "momentum": 0.99, "scale": true}, "name": "batch_normalization_4", "class_name": "BatchNormalization", "inbound_nodes": [[["input_2", 0, 0, {}]]]}, {"config": {"gamma_constraint": null, "trainable": true, "name": "batch_normalization_1", "beta_regularizer": null, "gamma_regularizer": null, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "epsilon": 0.001, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "beta_constraint": null, "axis": -1, "center": true, "momentum": 0.99, "scale": true}, "name": "batch_normalization_1", "class_name": "BatchNormalization", "inbound_nodes": [[["input_1", 0, 0, {}]]]}, {"config": {"alpha_constraint": null, "trainable": true, "name": "p_re_lu_4", "alpha_initializer": {"config": {}, "class_name": "Zeros"}, "shared_axes": null, "alpha_regularizer": null}, "name": "p_re_lu_4", "class_name": "PReLU", "inbound_nodes": [[["batch_normalization_4", 0, 0, {}]]]}, {"config": {"alpha_constraint": null, "trainable": true, "name": "p_re_lu_1", "alpha_initializer": {"config": {}, "class_name": "Zeros"}, "shared_axes": null, "alpha_regularizer": null}, "name": "p_re_lu_1", "class_name": "PReLU", "inbound_nodes": [[["batch_normalization_1", 0, 0, {}]]]}, {"config": {"use_bias": true, "trainable": true, "name": "conv1d_4", "activity_regularizer": null, "bias_constraint": null, "padding": "valid", "kernel_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_size": [1], "strides": [1], "kernel_constraint": null, "bias_regularizer": null, "activation": "linear", "kernel_initializer": {"config": {"distribution": "normal", "mode": "fan_in", "seed": null, "scale": 2.0}, "class_name": "VarianceScaling"}, "filters": 192, "dilation_rate": [1]}, "name": "conv1d_4", "class_name": "Conv1D", "inbound_nodes": [[["p_re_lu_4", 0, 0, {}]]]}, {"config": {"use_bias": true, "trainable": true, "name": "conv1d_1", "activity_regularizer": null, "bias_constraint": null, "padding": "valid", "kernel_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_size": [1], "strides": [1], "kernel_constraint": null, "bias_regularizer": null, "activation": "linear", "kernel_initializer": {"config": {"distribution": "normal", "mode": "fan_in", "seed": null, "scale": 2.0}, "class_name": "VarianceScaling"}, "filters": 192, "dilation_rate": [1]}, "name": "conv1d_1", "class_name": "Conv1D", "inbound_nodes": [[["p_re_lu_1", 0, 0, {}]]]}, {"config": {"gamma_constraint": null, "trainable": true, "name": "batch_normalization_5", "beta_regularizer": null, "gamma_regularizer": null, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "epsilon": 0.001, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "beta_constraint": null, "axis": -1, "center": true, "momentum": 0.99, "scale": true}, "name": "batch_normalization_5", "class_name": "BatchNormalization", "inbound_nodes": [[["conv1d_4", 0, 0, {}]]]}, {"config": {"gamma_constraint": null, "trainable": true, "name": "batch_normalization_2", "beta_regularizer": null, "gamma_regularizer": null, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "epsilon": 0.001, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "beta_constraint": null, "axis": -1, "center": true, "momentum": 0.99, "scale": true}, "name": "batch_normalization_2", "class_name": "BatchNormalization", "inbound_nodes": [[["conv1d_1", 0, 0, {}]]]}, {"config": {"alpha_constraint": null, "trainable": true, "name": "p_re_lu_5", "alpha_initializer": {"config": {}, "class_name": "Zeros"}, "shared_axes": null, "alpha_regularizer": null}, "name": "p_re_lu_5", "class_name": "PReLU", "inbound_nodes": [[["batch_normalization_5", 0, 0, {}]]]}, {"config": {"alpha_constraint": null, "trainable": true, "name": "p_re_lu_2", "alpha_initializer": {"config": {}, "class_name": "Zeros"}, "shared_axes": null, "alpha_regularizer": null}, "name": "p_re_lu_2", "class_name": "PReLU", "inbound_nodes": [[["batch_normalization_2", 0, 0, {}]]]}, {"config": {"use_bias": true, "trainable": true, "name": "conv1d_5", "activity_regularizer": null, "bias_constraint": null, "padding": "valid", "kernel_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_size": [1], "strides": [1], "kernel_constraint": null, "bias_regularizer": null, "activation": "linear", "kernel_initializer": {"config": {"distribution": "normal", "mode": "fan_in", "seed": null, "scale": 2.0}, "class_name": "VarianceScaling"}, "filters": 128, "dilation_rate": [1]}, "name": "conv1d_5", "class_name": "Conv1D", "inbound_nodes": [[["p_re_lu_5", 0, 0, {}]]]}, {"config": {"use_bias": true, "trainable": true, "name": "conv1d_2", "activity_regularizer": null, "bias_constraint": null, "padding": "valid", "kernel_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_size": [1], "strides": [1], "kernel_constraint": null, "bias_regularizer": null, "activation": "linear", "kernel_initializer": {"config": {"distribution": "normal", "mode": "fan_in", "seed": null, "scale": 2.0}, "class_name": "VarianceScaling"}, "filters": 128, "dilation_rate": [1]}, "name": "conv1d_2", "class_name": "Conv1D", "inbound_nodes": [[["p_re_lu_2", 0, 0, {}]]]}, {"config": {"gamma_constraint": null, "trainable": true, "name": "batch_normalization_6", "beta_regularizer": null, "gamma_regularizer": null, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "epsilon": 0.001, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "beta_constraint": null, "axis": -1, "center": true, "momentum": 0.99, "scale": true}, "name": "batch_normalization_6", "class_name": "BatchNormalization", "inbound_nodes": [[["conv1d_5", 0, 0, {}]]]}, {"config": {"gamma_constraint": null, "trainable": true, "name": "batch_normalization_3", "beta_regularizer": null, "gamma_regularizer": null, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "epsilon": 0.001, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "beta_constraint": null, "axis": -1, "center": true, "momentum": 0.99, "scale": true}, "name": "batch_normalization_3", "class_name": "BatchNormalization", "inbound_nodes": [[["conv1d_2", 0, 0, {}]]]}, {"config": {"alpha_constraint": null, "trainable": true, "name": "p_re_lu_6", "alpha_initializer": {"config": {}, "class_name": "Zeros"}, "shared_axes": null, "alpha_regularizer": null}, "name": "p_re_lu_6", "class_name": "PReLU", "inbound_nodes": [[["batch_normalization_6", 0, 0, {}]]]}, {"config": {"alpha_constraint": null, "trainable": true, "name": "p_re_lu_3", "alpha_initializer": {"config": {}, "class_name": "Zeros"}, "shared_axes": null, "alpha_regularizer": null}, "name": "p_re_lu_3", "class_name": "PReLU", "inbound_nodes": [[["batch_normalization_3", 0, 0, {}]]]}, {"config": {"use_bias": true, "trainable": true, "name": "conv1d_6", "activity_regularizer": null, "bias_constraint": null, "padding": "valid", "kernel_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_size": [1], "strides": [1], "kernel_constraint": null, "bias_regularizer": null, "activation": "linear", "kernel_initializer": {"config": {"distribution": "normal", "mode": "fan_in", "seed": null, "scale": 2.0}, "class_name": "VarianceScaling"}, "filters": 20, "dilation_rate": [1]}, "name": "conv1d_6", "class_name": "Conv1D", "inbound_nodes": [[["p_re_lu_6", 0, 0, {}]]]}, {"config": {"use_bias": true, "trainable": true, "name": "conv1d_3", "activity_regularizer": null, "bias_constraint": null, "padding": "valid", "kernel_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_size": [1], "strides": [1], "kernel_constraint": null, "bias_regularizer": null, "activation": "linear", "kernel_initializer": {"config": {"distribution": "normal", "mode": "fan_in", "seed": null, "scale": 2.0}, "class_name": "VarianceScaling"}, "filters": 20, "dilation_rate": [1]}, "name": "conv1d_3", "class_name": "Conv1D", "inbound_nodes": [[["p_re_lu_3", 0, 0, {}]]]}, {"config": {"trainable": true, "name": "add_2"}, "name": "add_2", "class_name": "Add", "inbound_nodes": [[["input_2", 0, 0, {}], ["conv1d_6", 0, 0, {}]]]}, {"config": {"trainable": true, "name": "add_1"}, "name": "add_1", "class_name": "Add", "inbound_nodes": [[["input_1", 0, 0, {}], ["conv1d_3", 0, 0, {}]]]}, {"config": {"trainable": true, "name": "flatten_2"}, "name": "flatten_2", "class_name": "Flatten", "inbound_nodes": [[["add_2", 0, 0, {}]]]}, {"config": {"trainable": true, "name": "flatten_1"}, "name": "flatten_1", "class_name": "Flatten", "inbound_nodes": [[["add_1", 0, 0, {}]]]}, {"config": {"trainable": true, "name": "concatenate_1", "axis": -1}, "name": "concatenate_1", "class_name": "Concatenate", "inbound_nodes": [[["flatten_2", 0, 0, {}], ["flatten_1", 0, 0, {}]]]}, {"config": {"use_bias": true, "trainable": true, "name": "dense_1", "activity_regularizer": null, "kernel_regularizer": null, "units": 64, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_constraint": null, "bias_regularizer": null, "activation": "linear", "kernel_initializer": {"config": {"distribution": "normal", "mode": "fan_in", "seed": null, "scale": 2.0}, "class_name": "VarianceScaling"}, "bias_constraint": null}, "name": "dense_1", "class_name": "Dense", "inbound_nodes": [[["concatenate_1", 0, 0, {}]]]}, {"config": {"gamma_constraint": null, "trainable": true, "name": "batch_normalization_7", "beta_regularizer": null, "gamma_regularizer": null, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "epsilon": 0.001, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "beta_constraint": null, "axis": -1, "center": true, "momentum": 0.99, "scale": true}, "name": "batch_normalization_7", "class_name": "BatchNormalization", "inbound_nodes": [[["dense_1", 0, 0, {}]]]}, {"config": {"alpha_constraint": null, "trainable": true, "name": "p_re_lu_7", "alpha_initializer": {"config": {}, "class_name": "Zeros"}, "shared_axes": null, "alpha_regularizer": null}, "name": "p_re_lu_7", "class_name": "PReLU", "inbound_nodes": [[["batch_normalization_7", 0, 0, {}]]]}, {"config": {"trainable": true, "name": "dropout_1", "rate": 0.3}, "name": "dropout_1", "class_name": "Dropout", "inbound_nodes": [[["p_re_lu_7", 0, 0, {}]]]}, {"config": {"use_bias": true, "trainable": true, "name": "dense_2", "activity_regularizer": null, "kernel_regularizer": null, "units": 64, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_constraint": null, "bias_regularizer": null, "activation": "linear", "kernel_initializer": {"config": {"distribution": "normal", "mode": "fan_in", "seed": null, "scale": 2.0}, "class_name": "VarianceScaling"}, "bias_constraint": null}, "name": "dense_2", "class_name": "Dense", "inbound_nodes": [[["dropout_1", 0, 0, {}]]]}, {"config": {"gamma_constraint": null, "trainable": true, "name": "batch_normalization_8", "beta_regularizer": null, "gamma_regularizer": null, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "epsilon": 0.001, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "beta_constraint": null, "axis": -1, "center": true, "momentum": 0.99, "scale": true}, "name": "batch_normalization_8", "class_name": "BatchNormalization", "inbound_nodes": [[["dense_2", 0, 0, {}]]]}, {"config": {"alpha_constraint": null, "trainable": true, "name": "p_re_lu_8", "alpha_initializer": {"config": {}, "class_name": "Zeros"}, "shared_axes": null, "alpha_regularizer": null}, "name": "p_re_lu_8", "class_name": "PReLU", "inbound_nodes": [[["batch_normalization_8", 0, 0, {}]]]}, {"config": {"trainable": true, "name": "dropout_2", "rate": 0.3}, "name": "dropout_2", "class_name": "Dropout", "inbound_nodes": [[["p_re_lu_8", 0, 0, {}]]]}, {"config": {"use_bias": true, "trainable": true, "name": "dense_3", "activity_regularizer": null, "kernel_regularizer": null, "units": 1, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_constraint": null, "bias_regularizer": null, "activation": "linear", "kernel_initializer": {"config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}, "class_name": "VarianceScaling"}, "bias_constraint": null}, "name": "dense_3", "class_name": "Dense", "inbound_nodes": [[["dropout_2", 0, 0, {}]]]}, {"config": {"alpha_constraint": null, "trainable": true, "name": "p_re_lu_9", "alpha_initializer": {"config": {}, "class_name": "Zeros"}, "shared_axes": null, "alpha_regularizer": null}, "name": "p_re_lu_9", "class_name": "PReLU", "inbound_nodes": [[["dense_3", 0, 0, {}]]]}], "name": "model_1", "output_layers": [["p_re_lu_9", 0, 0]], "input_layers": [["input_1", 0, 0], ["input_2", 0, 0]]}, "class_name": "Model", "keras_version": "2.0.3", "backend": "theano"}