{"config": {"input_layers": [["input_1", 0, 0], ["input_2", 0, 0]], "layers": [{"config": {"sparse": false, "dtype": "float32", "batch_input_shape": [null, 9, 20], "name": "input_2"}, "inbound_nodes": [], "class_name": "InputLayer", "name": "input_2"}, {"config": {"sparse": false, "dtype": "float32", "batch_input_shape": [null, 48, 20], "name": "input_1"}, "inbound_nodes": [], "class_name": "InputLayer", "name": "input_1"}, {"config": {"beta_initializer": {"config": {}, "class_name": "Zeros"}, "center": true, "beta_constraint": null, "scale": true, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "trainable": true, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "momentum": 0.99, "epsilon": 0.001, "gamma_regularizer": null, "name": "batch_normalization_4", "beta_regularizer": null, "gamma_constraint": null, "axis": -1}, "inbound_nodes": [[["input_2", 0, 0, {}]]], "class_name": "BatchNormalization", "name": "batch_normalization_4"}, {"config": {"beta_initializer": {"config": {}, "class_name": "Zeros"}, "center": true, "beta_constraint": null, "scale": true, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "trainable": true, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "momentum": 0.99, "epsilon": 0.001, "gamma_regularizer": null, "name": "batch_normalization_1", "beta_regularizer": null, "gamma_constraint": null, "axis": -1}, "inbound_nodes": [[["input_1", 0, 0, {}]]], "class_name": "BatchNormalization", "name": "batch_normalization_1"}, {"config": {"alpha_constraint": null, "alpha_initializer": {"config": {}, "class_name": "Zeros"}, "alpha_regularizer": null, "shared_axes": null, "trainable": true, "name": "p_re_lu_4"}, "inbound_nodes": [[["batch_normalization_4", 0, 0, {}]]], "class_name": "PReLU", "name": "p_re_lu_4"}, {"config": {"alpha_constraint": null, "alpha_initializer": {"config": {}, "class_name": "Zeros"}, "alpha_regularizer": null, "shared_axes": null, "trainable": true, "name": "p_re_lu_1"}, "inbound_nodes": [[["batch_normalization_1", 0, 0, {}]]], "class_name": "PReLU", "name": "p_re_lu_1"}, {"config": {"kernel_size": [1], "strides": [1], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_regularizer": null, "activation": "linear", "activity_regularizer": null, "trainable": true, "kernel_initializer": {"config": {"mode": "fan_in", "scale": 2.0, "seed": null, "distribution": "normal"}, "class_name": "VarianceScaling"}, "bias_constraint": null, "bias_regularizer": null, "padding": "valid", "name": "conv1d_4", "dilation_rate": [1], "filters": 192, "use_bias": true, "kernel_constraint": null}, "inbound_nodes": [[["p_re_lu_4", 0, 0, {}]]], "class_name": "Conv1D", "name": "conv1d_4"}, {"config": {"kernel_size": [1], "strides": [1], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_regularizer": null, "activation": "linear", "activity_regularizer": null, "trainable": true, "kernel_initializer": {"config": {"mode": "fan_in", "scale": 2.0, "seed": null, "distribution": "normal"}, "class_name": "VarianceScaling"}, "bias_constraint": null, "bias_regularizer": null, "padding": "valid", "name": "conv1d_1", "dilation_rate": [1], "filters": 192, "use_bias": true, "kernel_constraint": null}, "inbound_nodes": [[["p_re_lu_1", 0, 0, {}]]], "class_name": "Conv1D", "name": "conv1d_1"}, {"config": {"beta_initializer": {"config": {}, "class_name": "Zeros"}, "center": true, "beta_constraint": null, "scale": true, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "trainable": true, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "momentum": 0.99, "epsilon": 0.001, "gamma_regularizer": null, "name": "batch_normalization_5", "beta_regularizer": null, "gamma_constraint": null, "axis": -1}, "inbound_nodes": [[["conv1d_4", 0, 0, {}]]], "class_name": "BatchNormalization", "name": "batch_normalization_5"}, {"config": {"beta_initializer": {"config": {}, "class_name": "Zeros"}, "center": true, "beta_constraint": null, "scale": true, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "trainable": true, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "momentum": 0.99, "epsilon": 0.001, "gamma_regularizer": null, "name": "batch_normalization_2", "beta_regularizer": null, "gamma_constraint": null, "axis": -1}, "inbound_nodes": [[["conv1d_1", 0, 0, {}]]], "class_name": "BatchNormalization", "name": "batch_normalization_2"}, {"config": {"alpha_constraint": null, "alpha_initializer": {"config": {}, "class_name": "Zeros"}, "alpha_regularizer": null, "shared_axes": null, "trainable": true, "name": "p_re_lu_5"}, "inbound_nodes": [[["batch_normalization_5", 0, 0, {}]]], "class_name": "PReLU", "name": "p_re_lu_5"}, {"config": {"alpha_constraint": null, "alpha_initializer": {"config": {}, "class_name": "Zeros"}, "alpha_regularizer": null, "shared_axes": null, "trainable": true, "name": "p_re_lu_2"}, "inbound_nodes": [[["batch_normalization_2", 0, 0, {}]]], "class_name": "PReLU", "name": "p_re_lu_2"}, {"config": {"kernel_size": [1], "strides": [1], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_regularizer": null, "activation": "linear", "activity_regularizer": null, "trainable": true, "kernel_initializer": {"config": {"mode": "fan_in", "scale": 2.0, "seed": null, "distribution": "normal"}, "class_name": "VarianceScaling"}, "bias_constraint": null, "bias_regularizer": null, "padding": "valid", "name": "conv1d_5", "dilation_rate": [1], "filters": 128, "use_bias": true, "kernel_constraint": null}, "inbound_nodes": [[["p_re_lu_5", 0, 0, {}]]], "class_name": "Conv1D", "name": "conv1d_5"}, {"config": {"kernel_size": [1], "strides": [1], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_regularizer": null, "activation": "linear", "activity_regularizer": null, "trainable": true, "kernel_initializer": {"config": {"mode": "fan_in", "scale": 2.0, "seed": null, "distribution": "normal"}, "class_name": "VarianceScaling"}, "bias_constraint": null, "bias_regularizer": null, "padding": "valid", "name": "conv1d_2", "dilation_rate": [1], "filters": 128, "use_bias": true, "kernel_constraint": null}, "inbound_nodes": [[["p_re_lu_2", 0, 0, {}]]], "class_name": "Conv1D", "name": "conv1d_2"}, {"config": {"beta_initializer": {"config": {}, "class_name": "Zeros"}, "center": true, "beta_constraint": null, "scale": true, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "trainable": true, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "momentum": 0.99, "epsilon": 0.001, "gamma_regularizer": null, "name": "batch_normalization_6", "beta_regularizer": null, "gamma_constraint": null, "axis": -1}, "inbound_nodes": [[["conv1d_5", 0, 0, {}]]], "class_name": "BatchNormalization", "name": "batch_normalization_6"}, {"config": {"beta_initializer": {"config": {}, "class_name": "Zeros"}, "center": true, "beta_constraint": null, "scale": true, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "trainable": true, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "momentum": 0.99, "epsilon": 0.001, "gamma_regularizer": null, "name": "batch_normalization_3", "beta_regularizer": null, "gamma_constraint": null, "axis": -1}, "inbound_nodes": [[["conv1d_2", 0, 0, {}]]], "class_name": "BatchNormalization", "name": "batch_normalization_3"}, {"config": {"alpha_constraint": null, "alpha_initializer": {"config": {}, "class_name": "Zeros"}, "alpha_regularizer": null, "shared_axes": null, "trainable": true, "name": "p_re_lu_6"}, "inbound_nodes": [[["batch_normalization_6", 0, 0, {}]]], "class_name": "PReLU", "name": "p_re_lu_6"}, {"config": {"alpha_constraint": null, "alpha_initializer": {"config": {}, "class_name": "Zeros"}, "alpha_regularizer": null, "shared_axes": null, "trainable": true, "name": "p_re_lu_3"}, "inbound_nodes": [[["batch_normalization_3", 0, 0, {}]]], "class_name": "PReLU", "name": "p_re_lu_3"}, {"config": {"kernel_size": [1], "strides": [1], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_regularizer": null, "activation": "linear", "activity_regularizer": null, "trainable": true, "kernel_initializer": {"config": {"mode": "fan_in", "scale": 2.0, "seed": null, "distribution": "normal"}, "class_name": "VarianceScaling"}, "bias_constraint": null, "bias_regularizer": null, "padding": "valid", "name": "conv1d_6", "dilation_rate": [1], "filters": 20, "use_bias": true, "kernel_constraint": null}, "inbound_nodes": [[["p_re_lu_6", 0, 0, {}]]], "class_name": "Conv1D", "name": "conv1d_6"}, {"config": {"kernel_size": [1], "strides": [1], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_regularizer": null, "activation": "linear", "activity_regularizer": null, "trainable": true, "kernel_initializer": {"config": {"mode": "fan_in", "scale": 2.0, "seed": null, "distribution": "normal"}, "class_name": "VarianceScaling"}, "bias_constraint": null, "bias_regularizer": null, "padding": "valid", "name": "conv1d_3", "dilation_rate": [1], "filters": 20, "use_bias": true, "kernel_constraint": null}, "inbound_nodes": [[["p_re_lu_3", 0, 0, {}]]], "class_name": "Conv1D", "name": "conv1d_3"}, {"config": {"trainable": true, "name": "add_2"}, "inbound_nodes": [[["input_2", 0, 0, {}], ["conv1d_6", 0, 0, {}]]], "class_name": "Add", "name": "add_2"}, {"config": {"trainable": true, "name": "add_1"}, "inbound_nodes": [[["input_1", 0, 0, {}], ["conv1d_3", 0, 0, {}]]], "class_name": "Add", "name": "add_1"}, {"config": {"trainable": true, "name": "flatten_2"}, "inbound_nodes": [[["add_2", 0, 0, {}]]], "class_name": "Flatten", "name": "flatten_2"}, {"config": {"trainable": true, "name": "flatten_1"}, "inbound_nodes": [[["add_1", 0, 0, {}]]], "class_name": "Flatten", "name": "flatten_1"}, {"config": {"trainable": true, "axis": -1, "name": "concatenate_1"}, "inbound_nodes": [[["flatten_2", 0, 0, {}], ["flatten_1", 0, 0, {}]]], "class_name": "Concatenate", "name": "concatenate_1"}, {"config": {"bias_regularizer": null, "activation": "linear", "activity_regularizer": null, "trainable": true, "kernel_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "name": "dense_1", "units": 64, "kernel_initializer": {"config": {"mode": "fan_in", "scale": 2.0, "seed": null, "distribution": "normal"}, "class_name": "VarianceScaling"}, "bias_constraint": null, "use_bias": true, "kernel_constraint": null}, "inbound_nodes": [[["concatenate_1", 0, 0, {}]]], "class_name": "Dense", "name": "dense_1"}, {"config": {"beta_initializer": {"config": {}, "class_name": "Zeros"}, "center": true, "beta_constraint": null, "scale": true, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "trainable": true, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "momentum": 0.99, "epsilon": 0.001, "gamma_regularizer": null, "name": "batch_normalization_7", "beta_regularizer": null, "gamma_constraint": null, "axis": -1}, "inbound_nodes": [[["dense_1", 0, 0, {}]]], "class_name": "BatchNormalization", "name": "batch_normalization_7"}, {"config": {"alpha_constraint": null, "alpha_initializer": {"config": {}, "class_name": "Zeros"}, "alpha_regularizer": null, "shared_axes": null, "trainable": true, "name": "p_re_lu_7"}, "inbound_nodes": [[["batch_normalization_7", 0, 0, {}]]], "class_name": "PReLU", "name": "p_re_lu_7"}, {"config": {"trainable": true, "rate": 0.3, "name": "dropout_1"}, "inbound_nodes": [[["p_re_lu_7", 0, 0, {}]]], "class_name": "Dropout", "name": "dropout_1"}, {"config": {"bias_regularizer": null, "activation": "linear", "activity_regularizer": null, "trainable": true, "kernel_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "name": "dense_2", "units": 64, "kernel_initializer": {"config": {"mode": "fan_in", "scale": 2.0, "seed": null, "distribution": "normal"}, "class_name": "VarianceScaling"}, "bias_constraint": null, "use_bias": true, "kernel_constraint": null}, "inbound_nodes": [[["dropout_1", 0, 0, {}]]], "class_name": "Dense", "name": "dense_2"}, {"config": {"beta_initializer": {"config": {}, "class_name": "Zeros"}, "center": true, "beta_constraint": null, "scale": true, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "trainable": true, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "momentum": 0.99, "epsilon": 0.001, "gamma_regularizer": null, "name": "batch_normalization_8", "beta_regularizer": null, "gamma_constraint": null, "axis": -1}, "inbound_nodes": [[["dense_2", 0, 0, {}]]], "class_name": "BatchNormalization", "name": "batch_normalization_8"}, {"config": {"alpha_constraint": null, "alpha_initializer": {"config": {}, "class_name": "Zeros"}, "alpha_regularizer": null, "shared_axes": null, "trainable": true, "name": "p_re_lu_8"}, "inbound_nodes": [[["batch_normalization_8", 0, 0, {}]]], "class_name": "PReLU", "name": "p_re_lu_8"}, {"config": {"trainable": true, "rate": 0.3, "name": "dropout_2"}, "inbound_nodes": [[["p_re_lu_8", 0, 0, {}]]], "class_name": "Dropout", "name": "dropout_2"}, {"config": {"bias_regularizer": null, "activation": "linear", "activity_regularizer": null, "trainable": true, "kernel_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "name": "dense_3", "units": 1, "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "bias_constraint": null, "use_bias": true, "kernel_constraint": null}, "inbound_nodes": [[["dropout_2", 0, 0, {}]]], "class_name": "Dense", "name": "dense_3"}, {"config": {"alpha_constraint": null, "alpha_initializer": {"config": {}, "class_name": "Zeros"}, "alpha_regularizer": null, "shared_axes": null, "trainable": true, "name": "p_re_lu_9"}, "inbound_nodes": [[["dense_3", 0, 0, {}]]], "class_name": "PReLU", "name": "p_re_lu_9"}], "output_layers": [["p_re_lu_9", 0, 0]], "name": "model_1"}, "backend": "theano", "keras_version": "2.0.3", "class_name": "Model"}