{"backend": "theano", "keras_version": "2.0.3", "class_name": "Model", "config": {"layers": [{"config": {"dtype": "float32", "name": "input_2", "batch_input_shape": [null, 9, 20], "sparse": false}, "name": "input_2", "inbound_nodes": [], "class_name": "InputLayer"}, {"config": {"dtype": "float32", "name": "input_1", "batch_input_shape": [null, 34, 20], "sparse": false}, "name": "input_1", "inbound_nodes": [], "class_name": "InputLayer"}, {"config": {"bias_regularizer": null, "name": "gru_3", "implementation": 2, "return_sequences": true, "bias_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_in", "scale": 2.0, "distribution": "normal"}}, "bias_constraint": null, "recurrent_regularizer": null, "recurrent_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_in", "scale": 2.0, "distribution": "normal"}}, "recurrent_activation": "hard_sigmoid", "recurrent_constraint": null, "stateful": false, "recurrent_dropout": 0.2, "kernel_constraint": null, "unroll": true, "use_bias": true, "units": 32, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_in", "scale": 2.0, "distribution": "normal"}}, "activation": "tanh", "go_backwards": false, "kernel_regularizer": null, "dropout": 0.2, "trainable": true, "activity_regularizer": null}, "name": "gru_3", "inbound_nodes": [[["input_2", 0, 0, {}]]], "class_name": "GRU"}, {"config": {"bias_regularizer": null, "name": "gru_1", "implementation": 2, "return_sequences": true, "bias_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_in", "scale": 2.0, "distribution": "normal"}}, "bias_constraint": null, "recurrent_regularizer": null, "recurrent_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_in", "scale": 2.0, "distribution": "normal"}}, "recurrent_activation": "hard_sigmoid", "recurrent_constraint": null, "stateful": false, "recurrent_dropout": 0.2, "kernel_constraint": null, "unroll": true, "use_bias": true, "units": 32, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_in", "scale": 2.0, "distribution": "normal"}}, "activation": "tanh", "go_backwards": false, "kernel_regularizer": null, "dropout": 0.2, "trainable": true, "activity_regularizer": null}, "name": "gru_1", "inbound_nodes": [[["input_1", 0, 0, {}]]], "class_name": "GRU"}, {"config": {"bias_regularizer": null, "name": "gru_4", "implementation": 2, "return_sequences": false, "bias_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_in", "scale": 2.0, "distribution": "normal"}}, "bias_constraint": null, "recurrent_regularizer": null, "recurrent_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_in", "scale": 2.0, "distribution": "normal"}}, "recurrent_activation": "hard_sigmoid", "recurrent_constraint": null, "stateful": false, "recurrent_dropout": 0.2, "kernel_constraint": null, "unroll": true, "use_bias": true, "units": 32, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_in", "scale": 2.0, "distribution": "normal"}}, "activation": "tanh", "go_backwards": false, "kernel_regularizer": null, "dropout": 0.2, "trainable": true, "activity_regularizer": null}, "name": "gru_4", "inbound_nodes": [[["gru_3", 0, 0, {}]]], "class_name": "GRU"}, {"config": {"bias_regularizer": null, "name": "gru_2", "implementation": 2, "return_sequences": false, "bias_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_in", "scale": 2.0, "distribution": "normal"}}, "bias_constraint": null, "recurrent_regularizer": null, "recurrent_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_in", "scale": 2.0, "distribution": "normal"}}, "recurrent_activation": "hard_sigmoid", "recurrent_constraint": null, "stateful": false, "recurrent_dropout": 0.2, "kernel_constraint": null, "unroll": true, "use_bias": true, "units": 32, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_in", "scale": 2.0, "distribution": "normal"}}, "activation": "tanh", "go_backwards": false, "kernel_regularizer": null, "dropout": 0.2, "trainable": true, "activity_regularizer": null}, "name": "gru_2", "inbound_nodes": [[["gru_1", 0, 0, {}]]], "class_name": "GRU"}, {"config": {"beta_constraint": null, "momentum": 0.99, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "name": "batch_normalization_2", "beta_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "axis": -1, "scale": true, "center": true, "trainable": true, "gamma_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 0.001}, "name": "batch_normalization_2", "inbound_nodes": [[["gru_4", 0, 0, {}]]], "class_name": "BatchNormalization"}, {"config": {"beta_constraint": null, "momentum": 0.99, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "name": "batch_normalization_1", "beta_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "axis": -1, "scale": true, "center": true, "trainable": true, "gamma_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 0.001}, "name": "batch_normalization_1", "inbound_nodes": [[["gru_2", 0, 0, {}]]], "class_name": "BatchNormalization"}, {"config": {"shared_axes": null, "alpha_regularizer": null, "alpha_constraint": null, "trainable": true, "name": "p_re_lu_2", "alpha_initializer": {"class_name": "Zeros", "config": {}}}, "name": "p_re_lu_2", "inbound_nodes": [[["batch_normalization_2", 0, 0, {}]]], "class_name": "PReLU"}, {"config": {"shared_axes": null, "alpha_regularizer": null, "alpha_constraint": null, "trainable": true, "name": "p_re_lu_1", "alpha_initializer": {"class_name": "Zeros", "config": {}}}, "name": "p_re_lu_1", "inbound_nodes": [[["batch_normalization_1", 0, 0, {}]]], "class_name": "PReLU"}, {"config": {"trainable": true, "name": "concatenate_1", "axis": -1}, "name": "concatenate_1", "inbound_nodes": [[["p_re_lu_2", 0, 0, {}], ["p_re_lu_1", 0, 0, {}]]], "class_name": "Concatenate"}, {"config": {"use_bias": true, "bias_regularizer": null, "units": 64, "name": "dense_1", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_in", "scale": 2.0, "distribution": "uniform"}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "activation": "linear", "kernel_regularizer": null, "trainable": true, "activity_regularizer": null, "kernel_constraint": null}, "name": "dense_1", "inbound_nodes": [[["concatenate_1", 0, 0, {}]]], "class_name": "Dense"}, {"config": {"beta_constraint": null, "momentum": 0.99, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "name": "batch_normalization_3", "beta_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "axis": -1, "scale": true, "center": true, "trainable": true, "gamma_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 0.001}, "name": "batch_normalization_3", "inbound_nodes": [[["dense_1", 0, 0, {}]]], "class_name": "BatchNormalization"}, {"config": {"shared_axes": null, "alpha_regularizer": null, "alpha_constraint": null, "trainable": true, "name": "p_re_lu_3", "alpha_initializer": {"class_name": "Zeros", "config": {}}}, "name": "p_re_lu_3", "inbound_nodes": [[["batch_normalization_3", 0, 0, {}]]], "class_name": "PReLU"}, {"config": {"name": "dropout_1", "trainable": true, "rate": 0.3}, "name": "dropout_1", "inbound_nodes": [[["p_re_lu_3", 0, 0, {}]]], "class_name": "Dropout"}, {"config": {"use_bias": true, "bias_regularizer": null, "units": 64, "name": "dense_2", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_in", "scale": 2.0, "distribution": "uniform"}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "activation": "linear", "kernel_regularizer": null, "trainable": true, "activity_regularizer": null, "kernel_constraint": null}, "name": "dense_2", "inbound_nodes": [[["dropout_1", 0, 0, {}]]], "class_name": "Dense"}, {"config": {"beta_constraint": null, "momentum": 0.99, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "name": "batch_normalization_4", "beta_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "axis": -1, "scale": true, "center": true, "trainable": true, "gamma_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 0.001}, "name": "batch_normalization_4", "inbound_nodes": [[["dense_2", 0, 0, {}]]], "class_name": "BatchNormalization"}, {"config": {"shared_axes": null, "alpha_regularizer": null, "alpha_constraint": null, "trainable": true, "name": "p_re_lu_4", "alpha_initializer": {"class_name": "Zeros", "config": {}}}, "name": "p_re_lu_4", "inbound_nodes": [[["batch_normalization_4", 0, 0, {}]]], "class_name": "PReLU"}, {"config": {"name": "dropout_2", "trainable": true, "rate": 0.3}, "name": "dropout_2", "inbound_nodes": [[["p_re_lu_4", 0, 0, {}]]], "class_name": "Dropout"}, {"config": {"use_bias": true, "bias_regularizer": null, "units": 1, "name": "dense_3", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "activation": "linear", "kernel_regularizer": null, "trainable": true, "activity_regularizer": null, "kernel_constraint": null}, "name": "dense_3", "inbound_nodes": [[["dropout_2", 0, 0, {}]]], "class_name": "Dense"}, {"config": {"shared_axes": null, "alpha_regularizer": null, "alpha_constraint": null, "trainable": true, "name": "p_re_lu_5", "alpha_initializer": {"class_name": "Zeros", "config": {}}}, "name": "p_re_lu_5", "inbound_nodes": [[["dense_3", 0, 0, {}]]], "class_name": "PReLU"}], "name": "model_1", "input_layers": [["input_1", 0, 0], ["input_2", 0, 0]], "output_layers": [["p_re_lu_5", 0, 0]]}}