{"keras_version": "2.0.3", "class_name": "Model", "config": {"output_layers": [["p_re_lu_19", 0, 0]], "layers": [{"class_name": "InputLayer", "name": "input_2", "config": {"batch_input_shape": [null, 9, 20], "sparse": false, "dtype": "float32", "name": "input_2"}, "inbound_nodes": []}, {"class_name": "InputLayer", "name": "input_1", "config": {"batch_input_shape": [null, 34, 20], "sparse": false, "dtype": "float32", "name": "input_1"}, "inbound_nodes": []}, {"class_name": "BatchNormalization", "name": "batch_normalization_9", "config": {"moving_variance_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "scale": true, "name": "batch_normalization_9", "axis": -1, "trainable": true, "gamma_constraint": null, "beta_regularizer": null, "epsilon": 0.001, "momentum": 0.99, "beta_constraint": null, "center": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null}, "inbound_nodes": [[["input_2", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "name": "batch_normalization_1", "config": {"moving_variance_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "scale": true, "name": "batch_normalization_1", "axis": -1, "trainable": true, "gamma_constraint": null, "beta_regularizer": null, "epsilon": 0.001, "momentum": 0.99, "beta_constraint": null, "center": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null}, "inbound_nodes": [[["input_1", 0, 0, {}]]]}, {"class_name": "PReLU", "name": "p_re_lu_9", "config": {"shared_axes": null, "alpha_regularizer": null, "alpha_constraint": null, "name": "p_re_lu_9", "alpha_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true}, "inbound_nodes": [[["batch_normalization_9", 0, 0, {}]]]}, {"class_name": "PReLU", "name": "p_re_lu_1", "config": {"shared_axes": null, "alpha_regularizer": null, "alpha_constraint": null, "name": "p_re_lu_1", "alpha_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true}, "inbound_nodes": [[["batch_normalization_1", 0, 0, {}]]]}, {"class_name": "Conv1D", "name": "conv1d_9", "config": {"trainable": true, "dilation_rate": [1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "conv1d_9", "filters": 192, "bias_regularizer": null, "activation": "linear", "bias_constraint": null, "kernel_regularizer": null, "kernel_constraint": null, "strides": [1], "use_bias": true, "activity_regularizer": null, "kernel_size": [1], "padding": "valid", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "normal", "mode": "fan_in", "scale": 2.0, "seed": null}}}, "inbound_nodes": [[["p_re_lu_9", 0, 0, {}]]]}, {"class_name": "Conv1D", "name": "conv1d_1", "config": {"trainable": true, "dilation_rate": [1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "conv1d_1", "filters": 192, "bias_regularizer": null, "activation": "linear", "bias_constraint": null, "kernel_regularizer": null, "kernel_constraint": null, "strides": [1], "use_bias": true, "activity_regularizer": null, "kernel_size": [1], "padding": "valid", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "normal", "mode": "fan_in", "scale": 2.0, "seed": null}}}, "inbound_nodes": [[["p_re_lu_1", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "name": "batch_normalization_10", "config": {"moving_variance_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "scale": true, "name": "batch_normalization_10", "axis": -1, "trainable": true, "gamma_constraint": null, "beta_regularizer": null, "epsilon": 0.001, "momentum": 0.99, "beta_constraint": null, "center": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null}, "inbound_nodes": [[["conv1d_9", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "name": "batch_normalization_2", "config": {"moving_variance_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "scale": true, "name": "batch_normalization_2", "axis": -1, "trainable": true, "gamma_constraint": null, "beta_regularizer": null, "epsilon": 0.001, "momentum": 0.99, "beta_constraint": null, "center": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null}, "inbound_nodes": [[["conv1d_1", 0, 0, {}]]]}, {"class_name": "PReLU", "name": "p_re_lu_10", "config": {"shared_axes": null, "alpha_regularizer": null, "alpha_constraint": null, "name": "p_re_lu_10", "alpha_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true}, "inbound_nodes": [[["batch_normalization_10", 0, 0, {}]]]}, {"class_name": "PReLU", "name": "p_re_lu_2", "config": {"shared_axes": null, "alpha_regularizer": null, "alpha_constraint": null, "name": "p_re_lu_2", "alpha_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true}, "inbound_nodes": [[["batch_normalization_2", 0, 0, {}]]]}, {"class_name": "Conv1D", "name": "conv1d_10", "config": {"trainable": true, "dilation_rate": [1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "conv1d_10", "filters": 20, "bias_regularizer": null, "activation": "linear", "bias_constraint": null, "kernel_regularizer": null, "kernel_constraint": null, "strides": [1], "use_bias": true, "activity_regularizer": null, "kernel_size": [1], "padding": "valid", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "normal", "mode": "fan_in", "scale": 2.0, "seed": null}}}, "inbound_nodes": [[["p_re_lu_10", 0, 0, {}]]]}, {"class_name": "Conv1D", "name": "conv1d_2", "config": {"trainable": true, "dilation_rate": [1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "conv1d_2", "filters": 20, "bias_regularizer": null, "activation": "linear", "bias_constraint": null, "kernel_regularizer": null, "kernel_constraint": null, "strides": [1], "use_bias": true, "activity_regularizer": null, "kernel_size": [1], "padding": "valid", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "normal", "mode": "fan_in", "scale": 2.0, "seed": null}}}, "inbound_nodes": [[["p_re_lu_2", 0, 0, {}]]]}, {"class_name": "Add", "name": "add_5", "config": {"trainable": true, "name": "add_5"}, "inbound_nodes": [[["input_2", 0, 0, {}], ["conv1d_10", 0, 0, {}]]]}, {"class_name": "Add", "name": "add_1", "config": {"trainable": true, "name": "add_1"}, "inbound_nodes": [[["input_1", 0, 0, {}], ["conv1d_2", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "name": "batch_normalization_11", "config": {"moving_variance_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "scale": true, "name": "batch_normalization_11", "axis": -1, "trainable": true, "gamma_constraint": null, "beta_regularizer": null, "epsilon": 0.001, "momentum": 0.99, "beta_constraint": null, "center": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null}, "inbound_nodes": [[["add_5", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "name": "batch_normalization_3", "config": {"moving_variance_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "scale": true, "name": "batch_normalization_3", "axis": -1, "trainable": true, "gamma_constraint": null, "beta_regularizer": null, "epsilon": 0.001, "momentum": 0.99, "beta_constraint": null, "center": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null}, "inbound_nodes": [[["add_1", 0, 0, {}]]]}, {"class_name": "PReLU", "name": "p_re_lu_11", "config": {"shared_axes": null, "alpha_regularizer": null, "alpha_constraint": null, "name": "p_re_lu_11", "alpha_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true}, "inbound_nodes": [[["batch_normalization_11", 0, 0, {}]]]}, {"class_name": "PReLU", "name": "p_re_lu_3", "config": {"shared_axes": null, "alpha_regularizer": null, "alpha_constraint": null, "name": "p_re_lu_3", "alpha_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true}, "inbound_nodes": [[["batch_normalization_3", 0, 0, {}]]]}, {"class_name": "Conv1D", "name": "conv1d_11", "config": {"trainable": true, "dilation_rate": [1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "conv1d_11", "filters": 192, "bias_regularizer": null, "activation": "linear", "bias_constraint": null, "kernel_regularizer": null, "kernel_constraint": null, "strides": [1], "use_bias": true, "activity_regularizer": null, "kernel_size": [1], "padding": "valid", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "normal", "mode": "fan_in", "scale": 2.0, "seed": null}}}, "inbound_nodes": [[["p_re_lu_11", 0, 0, {}]]]}, {"class_name": "Conv1D", "name": "conv1d_3", "config": {"trainable": true, "dilation_rate": [1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "conv1d_3", "filters": 192, "bias_regularizer": null, "activation": "linear", "bias_constraint": null, "kernel_regularizer": null, "kernel_constraint": null, "strides": [1], "use_bias": true, "activity_regularizer": null, "kernel_size": [1], "padding": "valid", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "normal", "mode": "fan_in", "scale": 2.0, "seed": null}}}, "inbound_nodes": [[["p_re_lu_3", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "name": "batch_normalization_12", "config": {"moving_variance_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "scale": true, "name": "batch_normalization_12", "axis": -1, "trainable": true, "gamma_constraint": null, "beta_regularizer": null, "epsilon": 0.001, "momentum": 0.99, "beta_constraint": null, "center": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null}, "inbound_nodes": [[["conv1d_11", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "name": "batch_normalization_4", "config": {"moving_variance_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "scale": true, "name": "batch_normalization_4", "axis": -1, "trainable": true, "gamma_constraint": null, "beta_regularizer": null, "epsilon": 0.001, "momentum": 0.99, "beta_constraint": null, "center": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null}, "inbound_nodes": [[["conv1d_3", 0, 0, {}]]]}, {"class_name": "PReLU", "name": "p_re_lu_12", "config": {"shared_axes": null, "alpha_regularizer": null, "alpha_constraint": null, "name": "p_re_lu_12", "alpha_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true}, "inbound_nodes": [[["batch_normalization_12", 0, 0, {}]]]}, {"class_name": "PReLU", "name": "p_re_lu_4", "config": {"shared_axes": null, "alpha_regularizer": null, "alpha_constraint": null, "name": "p_re_lu_4", "alpha_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true}, "inbound_nodes": [[["batch_normalization_4", 0, 0, {}]]]}, {"class_name": "Conv1D", "name": "conv1d_12", "config": {"trainable": true, "dilation_rate": [1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "conv1d_12", "filters": 20, "bias_regularizer": null, "activation": "linear", "bias_constraint": null, "kernel_regularizer": null, "kernel_constraint": null, "strides": [1], "use_bias": true, "activity_regularizer": null, "kernel_size": [1], "padding": "valid", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "normal", "mode": "fan_in", "scale": 2.0, "seed": null}}}, "inbound_nodes": [[["p_re_lu_12", 0, 0, {}]]]}, {"class_name": "Conv1D", "name": "conv1d_4", "config": {"trainable": true, "dilation_rate": [1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "conv1d_4", "filters": 20, "bias_regularizer": null, "activation": "linear", "bias_constraint": null, "kernel_regularizer": null, "kernel_constraint": null, "strides": [1], "use_bias": true, "activity_regularizer": null, "kernel_size": [1], "padding": "valid", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "normal", "mode": "fan_in", "scale": 2.0, "seed": null}}}, "inbound_nodes": [[["p_re_lu_4", 0, 0, {}]]]}, {"class_name": "Add", "name": "add_6", "config": {"trainable": true, "name": "add_6"}, "inbound_nodes": [[["add_5", 0, 0, {}], ["conv1d_12", 0, 0, {}]]]}, {"class_name": "Add", "name": "add_2", "config": {"trainable": true, "name": "add_2"}, "inbound_nodes": [[["add_1", 0, 0, {}], ["conv1d_4", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "name": "batch_normalization_13", "config": {"moving_variance_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "scale": true, "name": "batch_normalization_13", "axis": -1, "trainable": true, "gamma_constraint": null, "beta_regularizer": null, "epsilon": 0.001, "momentum": 0.99, "beta_constraint": null, "center": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null}, "inbound_nodes": [[["add_6", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "name": "batch_normalization_5", "config": {"moving_variance_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "scale": true, "name": "batch_normalization_5", "axis": -1, "trainable": true, "gamma_constraint": null, "beta_regularizer": null, "epsilon": 0.001, "momentum": 0.99, "beta_constraint": null, "center": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null}, "inbound_nodes": [[["add_2", 0, 0, {}]]]}, {"class_name": "PReLU", "name": "p_re_lu_13", "config": {"shared_axes": null, "alpha_regularizer": null, "alpha_constraint": null, "name": "p_re_lu_13", "alpha_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true}, "inbound_nodes": [[["batch_normalization_13", 0, 0, {}]]]}, {"class_name": "PReLU", "name": "p_re_lu_5", "config": {"shared_axes": null, "alpha_regularizer": null, "alpha_constraint": null, "name": "p_re_lu_5", "alpha_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true}, "inbound_nodes": [[["batch_normalization_5", 0, 0, {}]]]}, {"class_name": "Conv1D", "name": "conv1d_13", "config": {"trainable": true, "dilation_rate": [1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "conv1d_13", "filters": 192, "bias_regularizer": null, "activation": "linear", "bias_constraint": null, "kernel_regularizer": null, "kernel_constraint": null, "strides": [1], "use_bias": true, "activity_regularizer": null, "kernel_size": [1], "padding": "valid", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "normal", "mode": "fan_in", "scale": 2.0, "seed": null}}}, "inbound_nodes": [[["p_re_lu_13", 0, 0, {}]]]}, {"class_name": "Conv1D", "name": "conv1d_5", "config": {"trainable": true, "dilation_rate": [1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "conv1d_5", "filters": 192, "bias_regularizer": null, "activation": "linear", "bias_constraint": null, "kernel_regularizer": null, "kernel_constraint": null, "strides": [1], "use_bias": true, "activity_regularizer": null, "kernel_size": [1], "padding": "valid", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "normal", "mode": "fan_in", "scale": 2.0, "seed": null}}}, "inbound_nodes": [[["p_re_lu_5", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "name": "batch_normalization_14", "config": {"moving_variance_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "scale": true, "name": "batch_normalization_14", "axis": -1, "trainable": true, "gamma_constraint": null, "beta_regularizer": null, "epsilon": 0.001, "momentum": 0.99, "beta_constraint": null, "center": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null}, "inbound_nodes": [[["conv1d_13", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "name": "batch_normalization_6", "config": {"moving_variance_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "scale": true, "name": "batch_normalization_6", "axis": -1, "trainable": true, "gamma_constraint": null, "beta_regularizer": null, "epsilon": 0.001, "momentum": 0.99, "beta_constraint": null, "center": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null}, "inbound_nodes": [[["conv1d_5", 0, 0, {}]]]}, {"class_name": "PReLU", "name": "p_re_lu_14", "config": {"shared_axes": null, "alpha_regularizer": null, "alpha_constraint": null, "name": "p_re_lu_14", "alpha_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true}, "inbound_nodes": [[["batch_normalization_14", 0, 0, {}]]]}, {"class_name": "PReLU", "name": "p_re_lu_6", "config": {"shared_axes": null, "alpha_regularizer": null, "alpha_constraint": null, "name": "p_re_lu_6", "alpha_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true}, "inbound_nodes": [[["batch_normalization_6", 0, 0, {}]]]}, {"class_name": "Conv1D", "name": "conv1d_14", "config": {"trainable": true, "dilation_rate": [1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "conv1d_14", "filters": 20, "bias_regularizer": null, "activation": "linear", "bias_constraint": null, "kernel_regularizer": null, "kernel_constraint": null, "strides": [1], "use_bias": true, "activity_regularizer": null, "kernel_size": [1], "padding": "valid", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "normal", "mode": "fan_in", "scale": 2.0, "seed": null}}}, "inbound_nodes": [[["p_re_lu_14", 0, 0, {}]]]}, {"class_name": "Conv1D", "name": "conv1d_6", "config": {"trainable": true, "dilation_rate": [1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "conv1d_6", "filters": 20, "bias_regularizer": null, "activation": "linear", "bias_constraint": null, "kernel_regularizer": null, "kernel_constraint": null, "strides": [1], "use_bias": true, "activity_regularizer": null, "kernel_size": [1], "padding": "valid", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "normal", "mode": "fan_in", "scale": 2.0, "seed": null}}}, "inbound_nodes": [[["p_re_lu_6", 0, 0, {}]]]}, {"class_name": "Add", "name": "add_7", "config": {"trainable": true, "name": "add_7"}, "inbound_nodes": [[["add_6", 0, 0, {}], ["conv1d_14", 0, 0, {}]]]}, {"class_name": "Add", "name": "add_3", "config": {"trainable": true, "name": "add_3"}, "inbound_nodes": [[["add_2", 0, 0, {}], ["conv1d_6", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "name": "batch_normalization_15", "config": {"moving_variance_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "scale": true, "name": "batch_normalization_15", "axis": -1, "trainable": true, "gamma_constraint": null, "beta_regularizer": null, "epsilon": 0.001, "momentum": 0.99, "beta_constraint": null, "center": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null}, "inbound_nodes": [[["add_7", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "name": "batch_normalization_7", "config": {"moving_variance_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "scale": true, "name": "batch_normalization_7", "axis": -1, "trainable": true, "gamma_constraint": null, "beta_regularizer": null, "epsilon": 0.001, "momentum": 0.99, "beta_constraint": null, "center": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null}, "inbound_nodes": [[["add_3", 0, 0, {}]]]}, {"class_name": "PReLU", "name": "p_re_lu_15", "config": {"shared_axes": null, "alpha_regularizer": null, "alpha_constraint": null, "name": "p_re_lu_15", "alpha_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true}, "inbound_nodes": [[["batch_normalization_15", 0, 0, {}]]]}, {"class_name": "PReLU", "name": "p_re_lu_7", "config": {"shared_axes": null, "alpha_regularizer": null, "alpha_constraint": null, "name": "p_re_lu_7", "alpha_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true}, "inbound_nodes": [[["batch_normalization_7", 0, 0, {}]]]}, {"class_name": "Conv1D", "name": "conv1d_15", "config": {"trainable": true, "dilation_rate": [1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "conv1d_15", "filters": 192, "bias_regularizer": null, "activation": "linear", "bias_constraint": null, "kernel_regularizer": null, "kernel_constraint": null, "strides": [1], "use_bias": true, "activity_regularizer": null, "kernel_size": [1], "padding": "valid", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "normal", "mode": "fan_in", "scale": 2.0, "seed": null}}}, "inbound_nodes": [[["p_re_lu_15", 0, 0, {}]]]}, {"class_name": "Conv1D", "name": "conv1d_7", "config": {"trainable": true, "dilation_rate": [1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "conv1d_7", "filters": 192, "bias_regularizer": null, "activation": "linear", "bias_constraint": null, "kernel_regularizer": null, "kernel_constraint": null, "strides": [1], "use_bias": true, "activity_regularizer": null, "kernel_size": [1], "padding": "valid", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "normal", "mode": "fan_in", "scale": 2.0, "seed": null}}}, "inbound_nodes": [[["p_re_lu_7", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "name": "batch_normalization_16", "config": {"moving_variance_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "scale": true, "name": "batch_normalization_16", "axis": -1, "trainable": true, "gamma_constraint": null, "beta_regularizer": null, "epsilon": 0.001, "momentum": 0.99, "beta_constraint": null, "center": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null}, "inbound_nodes": [[["conv1d_15", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "name": "batch_normalization_8", "config": {"moving_variance_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "scale": true, "name": "batch_normalization_8", "axis": -1, "trainable": true, "gamma_constraint": null, "beta_regularizer": null, "epsilon": 0.001, "momentum": 0.99, "beta_constraint": null, "center": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null}, "inbound_nodes": [[["conv1d_7", 0, 0, {}]]]}, {"class_name": "PReLU", "name": "p_re_lu_16", "config": {"shared_axes": null, "alpha_regularizer": null, "alpha_constraint": null, "name": "p_re_lu_16", "alpha_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true}, "inbound_nodes": [[["batch_normalization_16", 0, 0, {}]]]}, {"class_name": "PReLU", "name": "p_re_lu_8", "config": {"shared_axes": null, "alpha_regularizer": null, "alpha_constraint": null, "name": "p_re_lu_8", "alpha_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true}, "inbound_nodes": [[["batch_normalization_8", 0, 0, {}]]]}, {"class_name": "Conv1D", "name": "conv1d_16", "config": {"trainable": true, "dilation_rate": [1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "conv1d_16", "filters": 20, "bias_regularizer": null, "activation": "linear", "bias_constraint": null, "kernel_regularizer": null, "kernel_constraint": null, "strides": [1], "use_bias": true, "activity_regularizer": null, "kernel_size": [1], "padding": "valid", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "normal", "mode": "fan_in", "scale": 2.0, "seed": null}}}, "inbound_nodes": [[["p_re_lu_16", 0, 0, {}]]]}, {"class_name": "Conv1D", "name": "conv1d_8", "config": {"trainable": true, "dilation_rate": [1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "conv1d_8", "filters": 20, "bias_regularizer": null, "activation": "linear", "bias_constraint": null, "kernel_regularizer": null, "kernel_constraint": null, "strides": [1], "use_bias": true, "activity_regularizer": null, "kernel_size": [1], "padding": "valid", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "normal", "mode": "fan_in", "scale": 2.0, "seed": null}}}, "inbound_nodes": [[["p_re_lu_8", 0, 0, {}]]]}, {"class_name": "Add", "name": "add_8", "config": {"trainable": true, "name": "add_8"}, "inbound_nodes": [[["add_7", 0, 0, {}], ["conv1d_16", 0, 0, {}]]]}, {"class_name": "Add", "name": "add_4", "config": {"trainable": true, "name": "add_4"}, "inbound_nodes": [[["add_3", 0, 0, {}], ["conv1d_8", 0, 0, {}]]]}, {"class_name": "Flatten", "name": "flatten_2", "config": {"trainable": true, "name": "flatten_2"}, "inbound_nodes": [[["add_8", 0, 0, {}]]]}, {"class_name": "Flatten", "name": "flatten_1", "config": {"trainable": true, "name": "flatten_1"}, "inbound_nodes": [[["add_4", 0, 0, {}]]]}, {"class_name": "Concatenate", "name": "concatenate_1", "config": {"axis": -1, "trainable": true, "name": "concatenate_1"}, "inbound_nodes": [[["flatten_2", 0, 0, {}], ["flatten_1", 0, 0, {}]]]}, {"class_name": "Dense", "name": "dense_1", "config": {"units": 64, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "linear", "name": "dense_1", "bias_regularizer": null, "trainable": true, "bias_constraint": null, "kernel_regularizer": null, "kernel_constraint": null, "use_bias": true, "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "normal", "mode": "fan_in", "scale": 2.0, "seed": null}}}, "inbound_nodes": [[["concatenate_1", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "name": "batch_normalization_17", "config": {"moving_variance_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "scale": true, "name": "batch_normalization_17", "axis": -1, "trainable": true, "gamma_constraint": null, "beta_regularizer": null, "epsilon": 0.001, "momentum": 0.99, "beta_constraint": null, "center": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null}, "inbound_nodes": [[["dense_1", 0, 0, {}]]]}, {"class_name": "PReLU", "name": "p_re_lu_17", "config": {"shared_axes": null, "alpha_regularizer": null, "alpha_constraint": null, "name": "p_re_lu_17", "alpha_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true}, "inbound_nodes": [[["batch_normalization_17", 0, 0, {}]]]}, {"class_name": "Dropout", "name": "dropout_1", "config": {"trainable": true, "rate": 0.3, "name": "dropout_1"}, "inbound_nodes": [[["p_re_lu_17", 0, 0, {}]]]}, {"class_name": "Dense", "name": "dense_2", "config": {"units": 64, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "linear", "name": "dense_2", "bias_regularizer": null, "trainable": true, "bias_constraint": null, "kernel_regularizer": null, "kernel_constraint": null, "use_bias": true, "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "normal", "mode": "fan_in", "scale": 2.0, "seed": null}}}, "inbound_nodes": [[["dropout_1", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "name": "batch_normalization_18", "config": {"moving_variance_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "scale": true, "name": "batch_normalization_18", "axis": -1, "trainable": true, "gamma_constraint": null, "beta_regularizer": null, "epsilon": 0.001, "momentum": 0.99, "beta_constraint": null, "center": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null}, "inbound_nodes": [[["dense_2", 0, 0, {}]]]}, {"class_name": "PReLU", "name": "p_re_lu_18", "config": {"shared_axes": null, "alpha_regularizer": null, "alpha_constraint": null, "name": "p_re_lu_18", "alpha_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true}, "inbound_nodes": [[["batch_normalization_18", 0, 0, {}]]]}, {"class_name": "Dropout", "name": "dropout_2", "config": {"trainable": true, "rate": 0.3, "name": "dropout_2"}, "inbound_nodes": [[["p_re_lu_18", 0, 0, {}]]]}, {"class_name": "Dense", "name": "dense_3", "config": {"units": 1, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "linear", "name": "dense_3", "bias_regularizer": null, "trainable": true, "bias_constraint": null, "kernel_regularizer": null, "kernel_constraint": null, "use_bias": true, "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}}}, "inbound_nodes": [[["dropout_2", 0, 0, {}]]]}, {"class_name": "PReLU", "name": "p_re_lu_19", "config": {"shared_axes": null, "alpha_regularizer": null, "alpha_constraint": null, "name": "p_re_lu_19", "alpha_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true}, "inbound_nodes": [[["dense_3", 0, 0, {}]]]}], "input_layers": [["input_1", 0, 0], ["input_2", 0, 0]], "name": "model_1"}, "backend": "theano"}