{"backend": "theano", "config": {"layers": [{"inbound_nodes": [], "class_name": "InputLayer", "config": {"sparse": false, "name": "input_2", "dtype": "float32", "batch_input_shape": [null, 9, 50]}, "name": "input_2"}, {"inbound_nodes": [], "class_name": "InputLayer", "config": {"sparse": false, "name": "input_1", "dtype": "float32", "batch_input_shape": [null, 48, 50]}, "name": "input_1"}, {"inbound_nodes": [[["input_2", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"gamma_initializer": {"config": {}, "class_name": "Ones"}, "gamma_constraint": null, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "beta_constraint": null, "beta_regularizer": null, "scale": true, "name": "batch_normalization_4", "center": true, "gamma_regularizer": null, "momentum": 0.99, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "epsilon": 0.001, "axis": -1, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}}, "name": "batch_normalization_4"}, {"inbound_nodes": [[["input_1", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"gamma_initializer": {"config": {}, "class_name": "Ones"}, "gamma_constraint": null, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "beta_constraint": null, "beta_regularizer": null, "scale": true, "name": "batch_normalization_1", "center": true, "gamma_regularizer": null, "momentum": 0.99, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "epsilon": 0.001, "axis": -1, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}}, "name": "batch_normalization_1"}, {"inbound_nodes": [[["batch_normalization_4", 0, 0, {}]]], "class_name": "PReLU", "config": {"alpha_constraint": null, "alpha_initializer": {"config": {}, "class_name": "Zeros"}, "alpha_regularizer": null, "trainable": true, "name": "p_re_lu_4", "shared_axes": null}, "name": "p_re_lu_4"}, {"inbound_nodes": [[["batch_normalization_1", 0, 0, {}]]], "class_name": "PReLU", "config": {"alpha_constraint": null, "alpha_initializer": {"config": {}, "class_name": "Zeros"}, "alpha_regularizer": null, "trainable": true, "name": "p_re_lu_1", "shared_axes": null}, "name": "p_re_lu_1"}, {"inbound_nodes": [[["p_re_lu_4", 0, 0, {}]]], "class_name": "Dropout", "config": {"trainable": true, "name": "dropout_4", "rate": 0.3}, "name": "dropout_4"}, {"inbound_nodes": [[["p_re_lu_1", 0, 0, {}]]], "class_name": "Dropout", "config": {"trainable": true, "name": "dropout_1", "rate": 0.3}, "name": "dropout_1"}, {"inbound_nodes": [[["dropout_4", 0, 0, {}]]], "class_name": "Conv1D", "config": {"kernel_regularizer": null, "bias_constraint": null, "kernel_initializer": {"config": {"seed": null, "scale": 2.0, "distribution": "normal", "mode": "fan_in"}, "class_name": "VarianceScaling"}, "kernel_constraint": null, "bias_regularizer": null, "name": "conv1d_4", "dilation_rate": [1], "use_bias": true, "activation": "linear", "activity_regularizer": null, "filters": 192, "kernel_size": [1], "trainable": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "strides": [1], "padding": "valid"}, "name": "conv1d_4"}, {"inbound_nodes": [[["dropout_1", 0, 0, {}]]], "class_name": "Conv1D", "config": {"kernel_regularizer": null, "bias_constraint": null, "kernel_initializer": {"config": {"seed": null, "scale": 2.0, "distribution": "normal", "mode": "fan_in"}, "class_name": "VarianceScaling"}, "kernel_constraint": null, "bias_regularizer": null, "name": "conv1d_1", "dilation_rate": [1], "use_bias": true, "activation": "linear", "activity_regularizer": null, "filters": 192, "kernel_size": [1], "trainable": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "strides": [1], "padding": "valid"}, "name": "conv1d_1"}, {"inbound_nodes": [[["conv1d_4", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"gamma_initializer": {"config": {}, "class_name": "Ones"}, "gamma_constraint": null, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "beta_constraint": null, "beta_regularizer": null, "scale": true, "name": "batch_normalization_5", "center": true, "gamma_regularizer": null, "momentum": 0.99, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "epsilon": 0.001, "axis": -1, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}}, "name": "batch_normalization_5"}, {"inbound_nodes": [[["conv1d_1", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"gamma_initializer": {"config": {}, "class_name": "Ones"}, "gamma_constraint": null, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "beta_constraint": null, "beta_regularizer": null, "scale": true, "name": "batch_normalization_2", "center": true, "gamma_regularizer": null, "momentum": 0.99, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "epsilon": 0.001, "axis": -1, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}}, "name": "batch_normalization_2"}, {"inbound_nodes": [[["batch_normalization_5", 0, 0, {}]]], "class_name": "PReLU", "config": {"alpha_constraint": null, "alpha_initializer": {"config": {}, "class_name": "Zeros"}, "alpha_regularizer": null, "trainable": true, "name": "p_re_lu_5", "shared_axes": null}, "name": "p_re_lu_5"}, {"inbound_nodes": [[["batch_normalization_2", 0, 0, {}]]], "class_name": "PReLU", "config": {"alpha_constraint": null, "alpha_initializer": {"config": {}, "class_name": "Zeros"}, "alpha_regularizer": null, "trainable": true, "name": "p_re_lu_2", "shared_axes": null}, "name": "p_re_lu_2"}, {"inbound_nodes": [[["p_re_lu_5", 0, 0, {}]]], "class_name": "Dropout", "config": {"trainable": true, "name": "dropout_5", "rate": 0.3}, "name": "dropout_5"}, {"inbound_nodes": [[["p_re_lu_2", 0, 0, {}]]], "class_name": "Dropout", "config": {"trainable": true, "name": "dropout_2", "rate": 0.3}, "name": "dropout_2"}, {"inbound_nodes": [[["dropout_5", 0, 0, {}]]], "class_name": "Conv1D", "config": {"kernel_regularizer": null, "bias_constraint": null, "kernel_initializer": {"config": {"seed": null, "scale": 2.0, "distribution": "normal", "mode": "fan_in"}, "class_name": "VarianceScaling"}, "kernel_constraint": null, "bias_regularizer": null, "name": "conv1d_5", "dilation_rate": [1], "use_bias": true, "activation": "linear", "activity_regularizer": null, "filters": 128, "kernel_size": [1], "trainable": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "strides": [1], "padding": "valid"}, "name": "conv1d_5"}, {"inbound_nodes": [[["dropout_2", 0, 0, {}]]], "class_name": "Conv1D", "config": {"kernel_regularizer": null, "bias_constraint": null, "kernel_initializer": {"config": {"seed": null, "scale": 2.0, "distribution": "normal", "mode": "fan_in"}, "class_name": "VarianceScaling"}, "kernel_constraint": null, "bias_regularizer": null, "name": "conv1d_2", "dilation_rate": [1], "use_bias": true, "activation": "linear", "activity_regularizer": null, "filters": 128, "kernel_size": [1], "trainable": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "strides": [1], "padding": "valid"}, "name": "conv1d_2"}, {"inbound_nodes": [[["conv1d_5", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"gamma_initializer": {"config": {}, "class_name": "Ones"}, "gamma_constraint": null, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "beta_constraint": null, "beta_regularizer": null, "scale": true, "name": "batch_normalization_6", "center": true, "gamma_regularizer": null, "momentum": 0.99, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "epsilon": 0.001, "axis": -1, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}}, "name": "batch_normalization_6"}, {"inbound_nodes": [[["conv1d_2", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"gamma_initializer": {"config": {}, "class_name": "Ones"}, "gamma_constraint": null, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "beta_constraint": null, "beta_regularizer": null, "scale": true, "name": "batch_normalization_3", "center": true, "gamma_regularizer": null, "momentum": 0.99, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "epsilon": 0.001, "axis": -1, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}}, "name": "batch_normalization_3"}, {"inbound_nodes": [[["batch_normalization_6", 0, 0, {}]]], "class_name": "PReLU", "config": {"alpha_constraint": null, "alpha_initializer": {"config": {}, "class_name": "Zeros"}, "alpha_regularizer": null, "trainable": true, "name": "p_re_lu_6", "shared_axes": null}, "name": "p_re_lu_6"}, {"inbound_nodes": [[["batch_normalization_3", 0, 0, {}]]], "class_name": "PReLU", "config": {"alpha_constraint": null, "alpha_initializer": {"config": {}, "class_name": "Zeros"}, "alpha_regularizer": null, "trainable": true, "name": "p_re_lu_3", "shared_axes": null}, "name": "p_re_lu_3"}, {"inbound_nodes": [[["p_re_lu_6", 0, 0, {}]]], "class_name": "Dropout", "config": {"trainable": true, "name": "dropout_6", "rate": 0.3}, "name": "dropout_6"}, {"inbound_nodes": [[["p_re_lu_3", 0, 0, {}]]], "class_name": "Dropout", "config": {"trainable": true, "name": "dropout_3", "rate": 0.3}, "name": "dropout_3"}, {"inbound_nodes": [[["dropout_6", 0, 0, {}]]], "class_name": "Conv1D", "config": {"kernel_regularizer": null, "bias_constraint": null, "kernel_initializer": {"config": {"seed": null, "scale": 2.0, "distribution": "normal", "mode": "fan_in"}, "class_name": "VarianceScaling"}, "kernel_constraint": null, "bias_regularizer": null, "name": "conv1d_6", "dilation_rate": [1], "use_bias": true, "activation": "linear", "activity_regularizer": null, "filters": 50, "kernel_size": [1], "trainable": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "strides": [1], "padding": "valid"}, "name": "conv1d_6"}, {"inbound_nodes": [[["dropout_3", 0, 0, {}]]], "class_name": "Conv1D", "config": {"kernel_regularizer": null, "bias_constraint": null, "kernel_initializer": {"config": {"seed": null, "scale": 2.0, "distribution": "normal", "mode": "fan_in"}, "class_name": "VarianceScaling"}, "kernel_constraint": null, "bias_regularizer": null, "name": "conv1d_3", "dilation_rate": [1], "use_bias": true, "activation": "linear", "activity_regularizer": null, "filters": 50, "kernel_size": [1], "trainable": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "strides": [1], "padding": "valid"}, "name": "conv1d_3"}, {"inbound_nodes": [[["input_2", 0, 0, {}], ["conv1d_6", 0, 0, {}]]], "class_name": "Add", "config": {"trainable": true, "name": "add_2"}, "name": "add_2"}, {"inbound_nodes": [[["input_1", 0, 0, {}], ["conv1d_3", 0, 0, {}]]], "class_name": "Add", "config": {"trainable": true, "name": "add_1"}, "name": "add_1"}, {"inbound_nodes": [[["add_2", 0, 0, {}]]], "class_name": "Flatten", "config": {"trainable": true, "name": "flatten_2"}, "name": "flatten_2"}, {"inbound_nodes": [[["add_1", 0, 0, {}]]], "class_name": "Flatten", "config": {"trainable": true, "name": "flatten_1"}, "name": "flatten_1"}, {"inbound_nodes": [[["flatten_2", 0, 0, {}], ["flatten_1", 0, 0, {}]]], "class_name": "Concatenate", "config": {"trainable": true, "axis": -1, "name": "concatenate_1"}, "name": "concatenate_1"}, {"inbound_nodes": [[["concatenate_1", 0, 0, {}]]], "class_name": "Dense", "config": {"kernel_regularizer": null, "bias_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_constraint": null, "bias_regularizer": null, "name": "dense_1", "use_bias": true, "activation": "linear", "activity_regularizer": null, "units": 64, "trainable": true, "kernel_initializer": {"config": {"seed": null, "scale": 2.0, "distribution": "normal", "mode": "fan_in"}, "class_name": "VarianceScaling"}}, "name": "dense_1"}, {"inbound_nodes": [[["dense_1", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"gamma_initializer": {"config": {}, "class_name": "Ones"}, "gamma_constraint": null, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "beta_constraint": null, "beta_regularizer": null, "scale": true, "name": "batch_normalization_7", "center": true, "gamma_regularizer": null, "momentum": 0.99, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "epsilon": 0.001, "axis": -1, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}}, "name": "batch_normalization_7"}, {"inbound_nodes": [[["batch_normalization_7", 0, 0, {}]]], "class_name": "PReLU", "config": {"alpha_constraint": null, "alpha_initializer": {"config": {}, "class_name": "Zeros"}, "alpha_regularizer": null, "trainable": true, "name": "p_re_lu_7", "shared_axes": null}, "name": "p_re_lu_7"}, {"inbound_nodes": [[["p_re_lu_7", 0, 0, {}]]], "class_name": "Dropout", "config": {"trainable": true, "name": "dropout_7", "rate": 0.5}, "name": "dropout_7"}, {"inbound_nodes": [[["dropout_7", 0, 0, {}]]], "class_name": "Dense", "config": {"kernel_regularizer": null, "bias_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_constraint": null, "bias_regularizer": null, "name": "dense_2", "use_bias": true, "activation": "linear", "activity_regularizer": null, "units": 64, "trainable": true, "kernel_initializer": {"config": {"seed": null, "scale": 2.0, "distribution": "normal", "mode": "fan_in"}, "class_name": "VarianceScaling"}}, "name": "dense_2"}, {"inbound_nodes": [[["dense_2", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"gamma_initializer": {"config": {}, "class_name": "Ones"}, "gamma_constraint": null, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "beta_constraint": null, "beta_regularizer": null, "scale": true, "name": "batch_normalization_8", "center": true, "gamma_regularizer": null, "momentum": 0.99, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "epsilon": 0.001, "axis": -1, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}}, "name": "batch_normalization_8"}, {"inbound_nodes": [[["batch_normalization_8", 0, 0, {}]]], "class_name": "PReLU", "config": {"alpha_constraint": null, "alpha_initializer": {"config": {}, "class_name": "Zeros"}, "alpha_regularizer": null, "trainable": true, "name": "p_re_lu_8", "shared_axes": null}, "name": "p_re_lu_8"}, {"inbound_nodes": [[["p_re_lu_8", 0, 0, {}]]], "class_name": "Dropout", "config": {"trainable": true, "name": "dropout_8", "rate": 0.5}, "name": "dropout_8"}, {"inbound_nodes": [[["dropout_8", 0, 0, {}]]], "class_name": "Dense", "config": {"kernel_regularizer": null, "bias_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_constraint": null, "bias_regularizer": null, "name": "dense_3", "use_bias": true, "activation": "linear", "activity_regularizer": null, "units": 1, "trainable": true, "kernel_initializer": {"config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}, "class_name": "VarianceScaling"}}, "name": "dense_3"}, {"inbound_nodes": [[["dense_3", 0, 0, {}]]], "class_name": "PReLU", "config": {"alpha_constraint": null, "alpha_initializer": {"config": {}, "class_name": "Zeros"}, "alpha_regularizer": null, "trainable": true, "name": "p_re_lu_9", "shared_axes": null}, "name": "p_re_lu_9"}], "input_layers": [["input_1", 0, 0], ["input_2", 0, 0]], "name": "model_1", "output_layers": [["p_re_lu_9", 0, 0]]}, "keras_version": "2.0.3", "class_name": "Model"}