{"class_name": "Model", "keras_version": "2.0.1", "config": {"layers": [{"class_name": "InputLayer", "config": {"dtype": "float32", "batch_input_shape": [null, 9, 20], "name": "input_2", "sparse": false}, "inbound_nodes": [], "name": "input_2"}, {"class_name": "InputLayer", "config": {"dtype": "float32", "batch_input_shape": [null, 34, 20], "name": "input_1", "sparse": false}, "inbound_nodes": [], "name": "input_1"}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_2"}, "inbound_nodes": [[["input_2", 0, 0, {}]]], "name": "flatten_2"}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_1"}, "inbound_nodes": [[["input_1", 0, 0, {}]]], "name": "flatten_1"}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "dense_3", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 128, "use_bias": true, "activity_regularizer": null}, "inbound_nodes": [[["flatten_2", 0, 0, {}]]], "name": "dense_3"}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "dense_1", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 128, "use_bias": true, "activity_regularizer": null}, "inbound_nodes": [[["flatten_1", 0, 0, {}]]], "name": "dense_1"}, {"class_name": "Dropout", "config": {"rate": 0.3, "trainable": true, "name": "dropout_3"}, "inbound_nodes": [[["dense_3", 0, 0, {}]]], "name": "dropout_3"}, {"class_name": "Dropout", "config": {"rate": 0.3, "trainable": true, "name": "dropout_1"}, "inbound_nodes": [[["dense_1", 0, 0, {}]]], "name": "dropout_1"}, {"class_name": "PReLU", "config": {"name": "p_re_lu_3", "alpha_constraint": null, "trainable": true, "alpha_regularizer": null, "alpha_initializer": {"class_name": "Zeros", "config": {}}, "shared_axes": null}, "inbound_nodes": [[["dropout_3", 0, 0, {}]]], "name": "p_re_lu_3"}, {"class_name": "PReLU", "config": {"name": "p_re_lu_1", "alpha_constraint": null, "trainable": true, "alpha_regularizer": null, "alpha_initializer": {"class_name": "Zeros", "config": {}}, "shared_axes": null}, "inbound_nodes": [[["dropout_1", 0, 0, {}]]], "name": "p_re_lu_1"}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "dense_4", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 32, "use_bias": true, "activity_regularizer": null}, "inbound_nodes": [[["p_re_lu_3", 0, 0, {}]]], "name": "dense_4"}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "dense_2", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 32, "use_bias": true, "activity_regularizer": null}, "inbound_nodes": [[["p_re_lu_1", 0, 0, {}]]], "name": "dense_2"}, {"class_name": "Dropout", "config": {"rate": 0.3, "trainable": true, "name": "dropout_4"}, "inbound_nodes": [[["dense_4", 0, 0, {}]]], "name": "dropout_4"}, {"class_name": "Dropout", "config": {"rate": 0.3, "trainable": true, "name": "dropout_2"}, "inbound_nodes": [[["dense_2", 0, 0, {}]]], "name": "dropout_2"}, {"class_name": "PReLU", "config": {"name": "p_re_lu_4", "alpha_constraint": null, "trainable": true, "alpha_regularizer": null, "alpha_initializer": {"class_name": "Zeros", "config": {}}, "shared_axes": null}, "inbound_nodes": [[["dropout_4", 0, 0, {}]]], "name": "p_re_lu_4"}, {"class_name": "PReLU", "config": {"name": "p_re_lu_2", "alpha_constraint": null, "trainable": true, "alpha_regularizer": null, "alpha_initializer": {"class_name": "Zeros", "config": {}}, "shared_axes": null}, "inbound_nodes": [[["dropout_2", 0, 0, {}]]], "name": "p_re_lu_2"}, {"class_name": "Concatenate", "config": {"trainable": true, "name": "concatenate_1", "axis": -1}, "inbound_nodes": [[["p_re_lu_4", 0, 0, {}], ["p_re_lu_2", 0, 0, {}]]], "name": "concatenate_1"}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "dense_5", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 128, "use_bias": true, "activity_regularizer": null}, "inbound_nodes": [[["concatenate_1", 0, 0, {}]]], "name": "dense_5"}, {"class_name": "Dropout", "config": {"rate": 0.3, "trainable": true, "name": "dropout_5"}, "inbound_nodes": [[["dense_5", 0, 0, {}]]], "name": "dropout_5"}, {"class_name": "PReLU", "config": {"name": "p_re_lu_5", "alpha_constraint": null, "trainable": true, "alpha_regularizer": null, "alpha_initializer": {"class_name": "Zeros", "config": {}}, "shared_axes": null}, "inbound_nodes": [[["dropout_5", 0, 0, {}]]], "name": "p_re_lu_5"}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "dense_6", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 64, "use_bias": true, "activity_regularizer": null}, "inbound_nodes": [[["p_re_lu_5", 0, 0, {}]]], "name": "dense_6"}, {"class_name": "Dropout", "config": {"rate": 0.3, "trainable": true, "name": "dropout_6"}, "inbound_nodes": [[["dense_6", 0, 0, {}]]], "name": "dropout_6"}, {"class_name": "PReLU", "config": {"name": "p_re_lu_6", "alpha_constraint": null, "trainable": true, "alpha_regularizer": null, "alpha_initializer": {"class_name": "Zeros", "config": {}}, "shared_axes": null}, "inbound_nodes": [[["dropout_6", 0, 0, {}]]], "name": "p_re_lu_6"}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "dense_7", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 16, "use_bias": true, "activity_regularizer": null}, "inbound_nodes": [[["p_re_lu_6", 0, 0, {}]]], "name": "dense_7"}, {"class_name": "Dropout", "config": {"rate": 0.3, "trainable": true, "name": "dropout_7"}, "inbound_nodes": [[["dense_7", 0, 0, {}]]], "name": "dropout_7"}, {"class_name": "PReLU", "config": {"name": "p_re_lu_7", "alpha_constraint": null, "trainable": true, "alpha_regularizer": null, "alpha_initializer": {"class_name": "Zeros", "config": {}}, "shared_axes": null}, "inbound_nodes": [[["dropout_7", 0, 0, {}]]], "name": "p_re_lu_7"}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "dense_8", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 1, "use_bias": true, "activity_regularizer": null}, "inbound_nodes": [[["p_re_lu_7", 0, 0, {}]]], "name": "dense_8"}, {"class_name": "PReLU", "config": {"name": "p_re_lu_8", "alpha_constraint": null, "trainable": true, "alpha_regularizer": null, "alpha_initializer": {"class_name": "Zeros", "config": {}}, "shared_axes": null}, "inbound_nodes": [[["dense_8", 0, 0, {}]]], "name": "p_re_lu_8"}], "input_layers": [["input_1", 0, 0], ["input_2", 0, 0]], "output_layers": [["p_re_lu_8", 0, 0]], "name": "model_1"}, "backend": "theano"}