{"class_name": "Model", "keras_version": "2.0.3", "backend": "theano", "config": {"name": "model_1", "layers": [{"name": "input_2", "class_name": "InputLayer", "config": {"sparse": false, "dtype": "float32", "name": "input_2", "batch_input_shape": [null, 9, 20]}, "inbound_nodes": []}, {"name": "input_1", "class_name": "InputLayer", "config": {"sparse": false, "dtype": "float32", "name": "input_1", "batch_input_shape": [null, 34, 20]}, "inbound_nodes": []}, {"name": "gru_2", "class_name": "GRU", "config": {"activity_regularizer": null, "unroll": true, "return_sequences": false, "use_bias": true, "stateful": false, "recurrent_constraint": null, "bias_regularizer": null, "dropout": 0.2, "recurrent_activation": "hard_sigmoid", "bias_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 2.0, "mode": "fan_in", "distribution": "normal"}}, "units": 64, "recurrent_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 2.0, "mode": "fan_in", "distribution": "normal"}}, "bias_constraint": null, "kernel_constraint": null, "implementation": 2, "recurrent_dropout": 0.2, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 2.0, "mode": "fan_in", "distribution": "normal"}}, "trainable": true, "activation": "tanh", "kernel_regularizer": null, "name": "gru_2", "go_backwards": false, "recurrent_regularizer": null}, "inbound_nodes": [[["input_2", 0, 0, {}]]]}, {"name": "gru_1", "class_name": "GRU", "config": {"activity_regularizer": null, "unroll": true, "return_sequences": false, "use_bias": true, "stateful": false, "recurrent_constraint": null, "bias_regularizer": null, "dropout": 0.2, "recurrent_activation": "hard_sigmoid", "bias_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 2.0, "mode": "fan_in", "distribution": "normal"}}, "units": 64, "recurrent_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 2.0, "mode": "fan_in", "distribution": "normal"}}, "bias_constraint": null, "kernel_constraint": null, "implementation": 2, "recurrent_dropout": 0.2, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 2.0, "mode": "fan_in", "distribution": "normal"}}, "trainable": true, "activation": "tanh", "kernel_regularizer": null, "name": "gru_1", "go_backwards": false, "recurrent_regularizer": null}, "inbound_nodes": [[["input_1", 0, 0, {}]]]}, {"name": "batch_normalization_2", "class_name": "BatchNormalization", "config": {"gamma_regularizer": null, "center": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "axis": -1, "scale": true, "beta_regularizer": null, "trainable": true, "epsilon": 0.001, "beta_constraint": null, "momentum": 0.99, "name": "batch_normalization_2", "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null}, "inbound_nodes": [[["gru_2", 0, 0, {}]]]}, {"name": "batch_normalization_1", "class_name": "BatchNormalization", "config": {"gamma_regularizer": null, "center": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "axis": -1, "scale": true, "beta_regularizer": null, "trainable": true, "epsilon": 0.001, "beta_constraint": null, "momentum": 0.99, "name": "batch_normalization_1", "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null}, "inbound_nodes": [[["gru_1", 0, 0, {}]]]}, {"name": "p_re_lu_2", "class_name": "PReLU", "config": {"shared_axes": null, "trainable": true, "alpha_initializer": {"class_name": "Zeros", "config": {}}, "name": "p_re_lu_2", "alpha_constraint": null, "alpha_regularizer": null}, "inbound_nodes": [[["batch_normalization_2", 0, 0, {}]]]}, {"name": "p_re_lu_1", "class_name": "PReLU", "config": {"shared_axes": null, "trainable": true, "alpha_initializer": {"class_name": "Zeros", "config": {}}, "name": "p_re_lu_1", "alpha_constraint": null, "alpha_regularizer": null}, "inbound_nodes": [[["batch_normalization_1", 0, 0, {}]]]}, {"name": "concatenate_1", "class_name": "Concatenate", "config": {"name": "concatenate_1", "axis": -1, "trainable": true}, "inbound_nodes": [[["p_re_lu_2", 0, 0, {}], ["p_re_lu_1", 0, 0, {}]]]}, {"name": "dense_1", "class_name": "Dense", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 64, "activity_regularizer": null, "bias_constraint": null, "kernel_constraint": null, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 2.0, "mode": "fan_in", "distribution": "uniform"}}, "trainable": true, "bias_regularizer": null, "kernel_regularizer": null, "name": "dense_1"}, "inbound_nodes": [[["concatenate_1", 0, 0, {}]]]}, {"name": "batch_normalization_3", "class_name": "BatchNormalization", "config": {"gamma_regularizer": null, "center": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "axis": -1, "scale": true, "beta_regularizer": null, "trainable": true, "epsilon": 0.001, "beta_constraint": null, "momentum": 0.99, "name": "batch_normalization_3", "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null}, "inbound_nodes": [[["dense_1", 0, 0, {}]]]}, {"name": "p_re_lu_3", "class_name": "PReLU", "config": {"shared_axes": null, "trainable": true, "alpha_initializer": {"class_name": "Zeros", "config": {}}, "name": "p_re_lu_3", "alpha_constraint": null, "alpha_regularizer": null}, "inbound_nodes": [[["batch_normalization_3", 0, 0, {}]]]}, {"name": "dropout_1", "class_name": "Dropout", "config": {"name": "dropout_1", "trainable": true, "rate": 0.3}, "inbound_nodes": [[["p_re_lu_3", 0, 0, {}]]]}, {"name": "dense_2", "class_name": "Dense", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 64, "activity_regularizer": null, "bias_constraint": null, "kernel_constraint": null, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 2.0, "mode": "fan_in", "distribution": "uniform"}}, "trainable": true, "bias_regularizer": null, "kernel_regularizer": null, "name": "dense_2"}, "inbound_nodes": [[["dropout_1", 0, 0, {}]]]}, {"name": "batch_normalization_4", "class_name": "BatchNormalization", "config": {"gamma_regularizer": null, "center": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "axis": -1, "scale": true, "beta_regularizer": null, "trainable": true, "epsilon": 0.001, "beta_constraint": null, "momentum": 0.99, "name": "batch_normalization_4", "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null}, "inbound_nodes": [[["dense_2", 0, 0, {}]]]}, {"name": "p_re_lu_4", "class_name": "PReLU", "config": {"shared_axes": null, "trainable": true, "alpha_initializer": {"class_name": "Zeros", "config": {}}, "name": "p_re_lu_4", "alpha_constraint": null, "alpha_regularizer": null}, "inbound_nodes": [[["batch_normalization_4", 0, 0, {}]]]}, {"name": "dropout_2", "class_name": "Dropout", "config": {"name": "dropout_2", "trainable": true, "rate": 0.3}, "inbound_nodes": [[["p_re_lu_4", 0, 0, {}]]]}, {"name": "dense_3", "class_name": "Dense", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 1, "activity_regularizer": null, "bias_constraint": null, "kernel_constraint": null, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}}, "trainable": true, "bias_regularizer": null, "kernel_regularizer": null, "name": "dense_3"}, "inbound_nodes": [[["dropout_2", 0, 0, {}]]]}, {"name": "p_re_lu_5", "class_name": "PReLU", "config": {"shared_axes": null, "trainable": true, "alpha_initializer": {"class_name": "Zeros", "config": {}}, "name": "p_re_lu_5", "alpha_constraint": null, "alpha_regularizer": null}, "inbound_nodes": [[["dense_3", 0, 0, {}]]]}], "output_layers": [["p_re_lu_5", 0, 0]], "input_layers": [["input_1", 0, 0], ["input_2", 0, 0]]}}